/* automatically generated by rust-bindgen 0.61.0 */

pub const mjVERSION_HEADER: u32 = 230;
pub const mjMINVAL: f64 = 0.000000000000001;
pub const mjPI: f64 = 3.141592653589793;
pub const mjMAXVAL: f64 = 10000000000.0;
pub const mjMINMU: f64 = 0.00001;
pub const mjMINIMP: f64 = 0.0001;
pub const mjMAXIMP: f64 = 0.9999;
pub const mjMAXCONPAIR: u32 = 50;
pub const mjMAXVFS: u32 = 2000;
pub const mjMAXVFSNAME: u32 = 1000;
pub const mjNEQDATA: u32 = 11;
pub const mjNDYN: u32 = 10;
pub const mjNGAIN: u32 = 10;
pub const mjNBIAS: u32 = 10;
pub const mjNFLUID: u32 = 12;
pub const mjNREF: u32 = 2;
pub const mjNIMP: u32 = 5;
pub const mjNSOLVER: u32 = 1000;
pub const mjNAUX: u32 = 10;
pub const mjMAXTEXTURE: u32 = 1000;
pub const mjMAXUISECT: u32 = 10;
pub const mjMAXUIITEM: u32 = 80;
pub const mjMAXUITEXT: u32 = 300;
pub const mjMAXUINAME: u32 = 40;
pub const mjMAXUIMULTI: u32 = 35;
pub const mjMAXUIEDIT: u32 = 7;
pub const mjMAXUIRECT: u32 = 25;
pub const mjSEPCLOSED: u32 = 1000;
pub const mjKEY_ESCAPE: u32 = 256;
pub const mjKEY_ENTER: u32 = 257;
pub const mjKEY_TAB: u32 = 258;
pub const mjKEY_BACKSPACE: u32 = 259;
pub const mjKEY_INSERT: u32 = 260;
pub const mjKEY_DELETE: u32 = 261;
pub const mjKEY_RIGHT: u32 = 262;
pub const mjKEY_LEFT: u32 = 263;
pub const mjKEY_DOWN: u32 = 264;
pub const mjKEY_UP: u32 = 265;
pub const mjKEY_PAGE_UP: u32 = 266;
pub const mjKEY_PAGE_DOWN: u32 = 267;
pub const mjKEY_HOME: u32 = 268;
pub const mjKEY_END: u32 = 269;
pub const mjKEY_F1: u32 = 290;

    LIGHT = 8,
    MESH = 9,
    SKIN = 10,
    HFIELD = 11,
    TEXTURE = 12,
    MATERIAL = 13,
    PAIR = 14,
    EXCLUDE = 15,
    EQUALITY = 16,
    TENDON = 17,
    ACTUATOR = 18,
    SENSOR = 19,
    NUMERIC = 20,
    TEXT = 21,
    TUPLE = 22,
    KEY = 23,
    PLUGIN = 24,
}
pub use self::mjtObj_ as mjtObj;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtConstraint_ {
    EQUALITY = 0,
    FRICTION_DOF = 1,
    FRICTION_TENDON = 2,
    LIMIT_JOINT = 3,
    LIMIT_TENDON = 4,
    CONTACT_FRICTIONLESS = 5,
    CONTACT_PYRAMIDAL = 6,
    CONTACT_ELLIPTIC = 7,
}
pub use self::mjtConstraint_ as mjtConstraint;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtConstraintState_ {
    SATISFIED = 0,
    QUADRATIC = 1,
    LINEARNEG = 2,
    LINEARPOS = 3,
    CONE = 4,
}
pub use self::mjtConstraintState_ as mjtConstraintState;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtSensor_ {
    TOUCH = 0,
    ACCELEROMETER = 1,
    VELOCIMETER = 2,
    GYRO = 3,
    FORCE = 4,
    TORQUE = 5,
    MAGNETOMETER = 6,
    RANGEFINDER = 7,
    JOINTPOS = 8,
    JOINTVEL = 9,
    TENDONPOS = 10,
    TENDONVEL = 11,
    ACTUATORPOS = 12,
    ACTUATORVEL = 13,
    ACTUATORFRC = 14,
    BALLQUAT = 15,
    BALLANGVEL = 16,
    JOINTLIMITPOS = 17,
    JOINTLIMITVEL = 18,
    JOINTLIMITFRC = 19,
    TENDONLIMITPOS = 20,
    TENDONLIMITVEL = 21,
    TENDONLIMITFRC = 22,
    FRAMEPOS = 23,
    FRAMEQUAT = 24,
    FRAMEXAXIS = 25,
    FRAMEYAXIS = 26,
    FRAMEZAXIS = 27,
    FRAMELINVEL = 28,
    FRAMEANGVEL = 29,
    FRAMELINACC = 30,
    FRAMEANGACC = 31,
    SUBTREECOM = 32,
    SUBTREELINVEL = 33,
    SUBTREEANGMOM = 34,
    CLOCK = 35,
    PLUGIN = 36,
    USER = 37,
}
pub use self::mjtSensor_ as mjtSensor;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtStage_ {
    NONE = 0,
    POS = 1,
    VEL = 2,
    ACC = 3,
}
pub use self::mjtStage_ as mjtStage;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtDataType_ {
    REAL = 0,
    POSITIVE = 1,
    AXIS = 2,
    QUATERNION = 3,
}
pub use self::mjtDataType_ as mjtDataType;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtLRMode_ {
    NONE = 0,
    MUSCLE = 1,
    MUSCLEUSER = 2,
    ALL = 3,
}
pub use self::mjtLRMode_ as mjtLRMode;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjLROpt_ {
    pub mode: ::std::os::raw::c_int,
    pub useexisting: ::std::os::raw::c_int,
    pub uselimit: ::std::os::raw::c_int,
    pub accel: mjtNum,
    pub maxforce: mjtNum,
    pub timeconst: mjtNum,
    pub timestep: mjtNum,
    pub inttotal: mjtNum,
    pub inteval: mjtNum,
    pub tolrange: mjtNum,
}
#[test]
fn bindgen_test_layout_mjLROpt_() {
    const UNINIT: ::std::mem::MaybeUninit<mjLROpt_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjLROpt_>(),
        72usize,
        concat!("Size of: ", stringify!(mjLROpt_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjLROpt_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjLROpt_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).useexisting) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(useexisting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uselimit) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(uselimit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(accel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxforce) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(maxforce)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeconst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(timeconst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestep) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(timestep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inttotal) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(inttotal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inteval) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(inteval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tolrange) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mjLROpt_),
            "::",
            stringify!(tolrange)
        )
    );
}
pub type mjLROpt = mjLROpt_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjVFS_ {
    pub nfile: ::std::os::raw::c_int,
    pub filename: [[::std::os::raw::c_char; 1000usize]; 2000usize],
    pub filesize: [::std::os::raw::c_int; 2000usize],
    pub filedata: [*mut ::std::os::raw::c_void; 2000usize],
}
#[test]
fn bindgen_test_layout_mjVFS_() {
    const UNINIT: ::std::mem::MaybeUninit<mjVFS_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVFS_>(),
        2024008usize,
        concat!("Size of: ", stringify!(mjVFS_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVFS_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjVFS_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nfile) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVFS_),
            "::",
            stringify!(nfile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVFS_),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filesize) as usize - ptr as usize },
        2000004usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVFS_),
            "::",
            stringify!(filesize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filedata) as usize - ptr as usize },
        2008008usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVFS_),
            "::",
            stringify!(filedata)
        )
    );
}
impl Default for mjVFS_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjVFS = mjVFS_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjOption_ {
    pub timestep: mjtNum,
    pub apirate: mjtNum,
    pub impratio: mjtNum,
    pub tolerance: mjtNum,
    pub noslip_tolerance: mjtNum,
    pub mpr_tolerance: mjtNum,
    pub gravity: [mjtNum; 3usize],
    pub wind: [mjtNum; 3usize],
    pub magnetic: [mjtNum; 3usize],
    pub density: mjtNum,
    pub viscosity: mjtNum,
    pub o_margin: mjtNum,
    pub o_solref: [mjtNum; 2usize],
    pub o_solimp: [mjtNum; 5usize],
    pub integrator: ::std::os::raw::c_int,
    pub collision: ::std::os::raw::c_int,
    pub cone: ::std::os::raw::c_int,
    pub jacobian: ::std::os::raw::c_int,
    pub solver: ::std::os::raw::c_int,
    pub iterations: ::std::os::raw::c_int,
    pub noslip_iterations: ::std::os::raw::c_int,
    pub mpr_iterations: ::std::os::raw::c_int,
    pub disableflags: ::std::os::raw::c_int,
    pub enableflags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjOption_() {
    const UNINIT: ::std::mem::MaybeUninit<mjOption_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjOption_>(),
        240usize,
        concat!("Size of: ", stringify!(mjOption_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjOption_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjOption_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestep) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(timestep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).apirate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(apirate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).impratio) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(impratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tolerance) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(tolerance)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).noslip_tolerance) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(noslip_tolerance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpr_tolerance) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(mpr_tolerance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gravity) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(gravity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wind) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(wind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).magnetic) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(magnetic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).density) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(density)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viscosity) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(viscosity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_margin) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(o_margin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_solref) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(o_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_solimp) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(o_solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).integrator) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(integrator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).collision) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(collision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cone) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(cone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jacobian) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(jacobian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solver) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(solver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iterations) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(iterations)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).noslip_iterations) as usize - ptr as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(noslip_iterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpr_iterations) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(mpr_iterations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disableflags) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(disableflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enableflags) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(mjOption_),
            "::",
            stringify!(enableflags)
        )
    );
}
pub type mjOption = mjOption_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual_ {
    pub global: mjVisual___bindgen_ty_1,
    pub quality: mjVisual___bindgen_ty_2,
    pub headlight: mjVisual___bindgen_ty_3,
    pub map: mjVisual___bindgen_ty_4,
    pub scale: mjVisual___bindgen_ty_5,
    pub rgba: mjVisual___bindgen_ty_6,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_1 {
    pub fovy: f32,
    pub ipd: f32,
    pub azimuth: f32,
    pub elevation: f32,
    pub linewidth: f32,
    pub glow: f32,
    pub realtime: f32,
    pub offwidth: ::std::os::raw::c_int,
    pub offheight: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fovy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(fovy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(ipd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).azimuth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(azimuth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linewidth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(linewidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).glow) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(glow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).realtime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(realtime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offwidth) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(offwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offheight) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_1),
            "::",
            stringify!(offheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_2 {
    pub shadowsize: ::std::os::raw::c_int,
    pub offsamples: ::std::os::raw::c_int,
    pub numslices: ::std::os::raw::c_int,
    pub numstacks: ::std::os::raw::c_int,
    pub numquads: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_2>(),
        20usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowsize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_2),
            "::",
            stringify!(shadowsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offsamples) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_2),
            "::",
            stringify!(offsamples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numslices) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_2),
            "::",
            stringify!(numslices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numstacks) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_2),
            "::",
            stringify!(numstacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numquads) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_2),
            "::",
            stringify!(numquads)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_3 {
    pub ambient: [f32; 3usize],
    pub diffuse: [f32; 3usize],
    pub specular: [f32; 3usize],
    pub active: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_3>(),
        40usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ambient) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_3),
            "::",
            stringify!(ambient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).diffuse) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_3),
            "::",
            stringify!(diffuse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).specular) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_3),
            "::",
            stringify!(specular)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_3),
            "::",
            stringify!(active)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_4 {
    pub stiffness: f32,
    pub stiffnessrot: f32,
    pub force: f32,
    pub torque: f32,
    pub alpha: f32,
    pub fogstart: f32,
    pub fogend: f32,
    pub znear: f32,
    pub zfar: f32,
    pub haze: f32,
    pub shadowclip: f32,
    pub shadowscale: f32,
    pub actuatortendon: f32,
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_4>(),
        52usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stiffness) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(stiffness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stiffnessrot) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(stiffnessrot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).force) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(force)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).torque) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(torque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(alpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fogstart) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(fogstart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fogend) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(fogend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).znear) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(znear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zfar) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(zfar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).haze) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(haze)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowclip) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(shadowclip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowscale) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(shadowscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuatortendon) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_4),
            "::",
            stringify!(actuatortendon)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_5 {
    pub forcewidth: f32,
    pub contactwidth: f32,
    pub contactheight: f32,
    pub connect: f32,
    pub com: f32,
    pub camera: f32,
    pub light: f32,
    pub selectpoint: f32,
    pub jointlength: f32,
    pub jointwidth: f32,
    pub actuatorlength: f32,
    pub actuatorwidth: f32,
    pub framelength: f32,
    pub framewidth: f32,
    pub constraint: f32,
    pub slidercrank: f32,
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_5> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_5>(),
        64usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).forcewidth) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(forcewidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactwidth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(contactwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactheight) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(contactheight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connect) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).com) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(com)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camera) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(camera)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(light)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).selectpoint) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(selectpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jointlength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(jointlength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jointwidth) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(jointwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuatorlength) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(actuatorlength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuatorwidth) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(actuatorwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framelength) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(framelength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framewidth) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(framewidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constraint) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(constraint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slidercrank) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_5),
            "::",
            stringify!(slidercrank)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjVisual___bindgen_ty_6 {
    pub fog: [f32; 4usize],
    pub haze: [f32; 4usize],
    pub force: [f32; 4usize],
    pub inertia: [f32; 4usize],
    pub joint: [f32; 4usize],
    pub actuator: [f32; 4usize],
    pub actuatornegative: [f32; 4usize],
    pub actuatorpositive: [f32; 4usize],
    pub com: [f32; 4usize],
    pub camera: [f32; 4usize],
    pub light: [f32; 4usize],
    pub selectpoint: [f32; 4usize],
    pub connect: [f32; 4usize],
    pub contactpoint: [f32; 4usize],
    pub contactforce: [f32; 4usize],
    pub contactfriction: [f32; 4usize],
    pub contacttorque: [f32; 4usize],
    pub contactgap: [f32; 4usize],
    pub rangefinder: [f32; 4usize],
    pub constraint: [f32; 4usize],
    pub slidercrank: [f32; 4usize],
    pub crankbroken: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_mjVisual___bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual___bindgen_ty_6> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual___bindgen_ty_6>(),
        352usize,
        concat!("Size of: ", stringify!(mjVisual___bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual___bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual___bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fog) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(fog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).haze) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(haze)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).force) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(force)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inertia) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(inertia)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).joint) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(joint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(actuator)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuatornegative) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(actuatornegative)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuatorpositive) as usize - ptr as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(actuatorpositive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).com) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(com)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camera) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(camera)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(light)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).selectpoint) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(selectpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connect) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactpoint) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(contactpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactforce) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(contactforce)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactfriction) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(contactfriction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contacttorque) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(contacttorque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contactgap) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(contactgap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangefinder) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(rangefinder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constraint) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(constraint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slidercrank) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(slidercrank)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crankbroken) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual___bindgen_ty_6),
            "::",
            stringify!(crankbroken)
        )
    );
}
#[test]
fn bindgen_test_layout_mjVisual_() {
    const UNINIT: ::std::mem::MaybeUninit<mjVisual_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjVisual_>(),
        564usize,
        concat!("Size of: ", stringify!(mjVisual_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjVisual_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjVisual_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).global) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(global)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(quality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).headlight) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(headlight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgba) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(mjVisual_),
            "::",
            stringify!(rgba)
        )
    );
}
pub type mjVisual = mjVisual_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjStatistic_ {
    pub meaninertia: mjtNum,
    pub meanmass: mjtNum,
    pub meansize: mjtNum,
    pub extent: mjtNum,
    pub center: [mjtNum; 3usize],
}
#[test]
fn bindgen_test_layout_mjStatistic_() {
    const UNINIT: ::std::mem::MaybeUninit<mjStatistic_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjStatistic_>(),
        56usize,
        concat!("Size of: ", stringify!(mjStatistic_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjStatistic_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjStatistic_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meaninertia) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjStatistic_),
            "::",
            stringify!(meaninertia)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meanmass) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjStatistic_),
            "::",
            stringify!(meanmass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meansize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjStatistic_),
            "::",
            stringify!(meansize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjStatistic_),
            "::",
            stringify!(extent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).center) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjStatistic_),
            "::",
            stringify!(center)
        )
    );
}
pub type mjStatistic = mjStatistic_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjModel_ {
    pub nq: ::std::os::raw::c_int,
    pub nv: ::std::os::raw::c_int,
    pub nu: ::std::os::raw::c_int,
    pub na: ::std::os::raw::c_int,
    pub nbody: ::std::os::raw::c_int,
    pub njnt: ::std::os::raw::c_int,
    pub ngeom: ::std::os::raw::c_int,
    pub nsite: ::std::os::raw::c_int,
    pub ncam: ::std::os::raw::c_int,
    pub nlight: ::std::os::raw::c_int,
    pub nmesh: ::std::os::raw::c_int,
    pub nmeshvert: ::std::os::raw::c_int,
    pub nmeshtexvert: ::std::os::raw::c_int,
    pub nmeshface: ::std::os::raw::c_int,
    pub nmeshgraph: ::std::os::raw::c_int,
    pub nskin: ::std::os::raw::c_int,
    pub nskinvert: ::std::os::raw::c_int,
    pub nskintexvert: ::std::os::raw::c_int,
    pub nskinface: ::std::os::raw::c_int,
    pub nskinbone: ::std::os::raw::c_int,
    pub nskinbonevert: ::std::os::raw::c_int,
    pub nhfield: ::std::os::raw::c_int,
    pub nhfielddata: ::std::os::raw::c_int,
    pub ntex: ::std::os::raw::c_int,
    pub ntexdata: ::std::os::raw::c_int,
    pub nmat: ::std::os::raw::c_int,
    pub npair: ::std::os::raw::c_int,
    pub nexclude: ::std::os::raw::c_int,
    pub neq: ::std::os::raw::c_int,
    pub ntendon: ::std::os::raw::c_int,
    pub nwrap: ::std::os::raw::c_int,
    pub nsensor: ::std::os::raw::c_int,
    pub nnumeric: ::std::os::raw::c_int,
    pub nnumericdata: ::std::os::raw::c_int,
    pub ntext: ::std::os::raw::c_int,
    pub ntextdata: ::std::os::raw::c_int,
    pub ntuple: ::std::os::raw::c_int,
    pub ntupledata: ::std::os::raw::c_int,
    pub nkey: ::std::os::raw::c_int,
    pub nmocap: ::std::os::raw::c_int,
    pub nplugin: ::std::os::raw::c_int,
    pub npluginattr: ::std::os::raw::c_int,
    pub nuser_body: ::std::os::raw::c_int,
    pub nuser_jnt: ::std::os::raw::c_int,
    pub nuser_geom: ::std::os::raw::c_int,
    pub nuser_site: ::std::os::raw::c_int,
    pub nuser_cam: ::std::os::raw::c_int,
    pub nuser_tendon: ::std::os::raw::c_int,
    pub nuser_actuator: ::std::os::raw::c_int,
    pub nuser_sensor: ::std::os::raw::c_int,
    pub nnames: ::std::os::raw::c_int,
    pub nM: ::std::os::raw::c_int,
    pub nD: ::std::os::raw::c_int,
    pub nemax: ::std::os::raw::c_int,
    pub njmax: ::std::os::raw::c_int,
    pub nconmax: ::std::os::raw::c_int,
    pub nstack: ::std::os::raw::c_int,
    pub nuserdata: ::std::os::raw::c_int,
    pub nsensordata: ::std::os::raw::c_int,
    pub npluginstate: ::std::os::raw::c_int,
    pub nbuffer: ::std::os::raw::c_int,
    pub opt: mjOption,
    pub vis: mjVisual,
    pub stat: mjStatistic,
    pub buffer: *mut ::std::os::raw::c_void,
    pub qpos0: *mut mjtNum,
    pub qpos_spring: *mut mjtNum,
    pub body_parentid: *mut ::std::os::raw::c_int,
    pub body_rootid: *mut ::std::os::raw::c_int,
    pub body_weldid: *mut ::std::os::raw::c_int,
    pub body_mocapid: *mut ::std::os::raw::c_int,
    pub body_jntnum: *mut ::std::os::raw::c_int,
    pub body_jntadr: *mut ::std::os::raw::c_int,
    pub body_dofnum: *mut ::std::os::raw::c_int,
    pub body_dofadr: *mut ::std::os::raw::c_int,
    pub body_geomnum: *mut ::std::os::raw::c_int,
    pub body_geomadr: *mut ::std::os::raw::c_int,
    pub body_simple: *mut mjtByte,
    pub body_sameframe: *mut mjtByte,
    pub body_pos: *mut mjtNum,
    pub body_quat: *mut mjtNum,
    pub body_ipos: *mut mjtNum,
    pub body_iquat: *mut mjtNum,
    pub body_mass: *mut mjtNum,
    pub body_subtreemass: *mut mjtNum,
    pub body_inertia: *mut mjtNum,
    pub body_invweight0: *mut mjtNum,
    pub body_user: *mut mjtNum,
    pub body_plugin: *mut ::std::os::raw::c_int,
    pub jnt_type: *mut ::std::os::raw::c_int,
    pub jnt_qposadr: *mut ::std::os::raw::c_int,
    pub jnt_dofadr: *mut ::std::os::raw::c_int,
    pub jnt_bodyid: *mut ::std::os::raw::c_int,
    pub jnt_group: *mut ::std::os::raw::c_int,
    pub jnt_limited: *mut mjtByte,
    pub jnt_solref: *mut mjtNum,
    pub jnt_solimp: *mut mjtNum,
    pub jnt_pos: *mut mjtNum,
    pub jnt_axis: *mut mjtNum,
    pub jnt_stiffness: *mut mjtNum,
    pub jnt_range: *mut mjtNum,
    pub jnt_margin: *mut mjtNum,
    pub jnt_user: *mut mjtNum,
    pub dof_bodyid: *mut ::std::os::raw::c_int,
    pub dof_jntid: *mut ::std::os::raw::c_int,
    pub dof_parentid: *mut ::std::os::raw::c_int,
    pub dof_Madr: *mut ::std::os::raw::c_int,
    pub dof_simplenum: *mut ::std::os::raw::c_int,
    pub dof_solref: *mut mjtNum,
    pub dof_solimp: *mut mjtNum,
    pub dof_frictionloss: *mut mjtNum,
    pub dof_armature: *mut mjtNum,
    pub dof_damping: *mut mjtNum,
    pub dof_invweight0: *mut mjtNum,
    pub dof_M0: *mut mjtNum,
    pub geom_type: *mut ::std::os::raw::c_int,
    pub geom_contype: *mut ::std::os::raw::c_int,
    pub geom_conaffinity: *mut ::std::os::raw::c_int,
    pub geom_condim: *mut ::std::os::raw::c_int,
    pub geom_bodyid: *mut ::std::os::raw::c_int,
    pub geom_dataid: *mut ::std::os::raw::c_int,
    pub geom_matid: *mut ::std::os::raw::c_int,
    pub geom_group: *mut ::std::os::raw::c_int,
    pub geom_priority: *mut ::std::os::raw::c_int,
    pub geom_sameframe: *mut mjtByte,
    pub geom_solmix: *mut mjtNum,
    pub geom_solref: *mut mjtNum,
    pub geom_solimp: *mut mjtNum,
    pub geom_size: *mut mjtNum,
    pub geom_rbound: *mut mjtNum,
    pub geom_pos: *mut mjtNum,
    pub geom_quat: *mut mjtNum,
    pub geom_friction: *mut mjtNum,
    pub geom_margin: *mut mjtNum,
    pub geom_gap: *mut mjtNum,
    pub geom_fluid: *mut mjtNum,
    pub geom_user: *mut mjtNum,
    pub geom_rgba: *mut f32,
    pub site_type: *mut ::std::os::raw::c_int,
    pub site_bodyid: *mut ::std::os::raw::c_int,
    pub site_matid: *mut ::std::os::raw::c_int,
    pub site_group: *mut ::std::os::raw::c_int,
    pub site_sameframe: *mut mjtByte,
    pub site_size: *mut mjtNum,
    pub site_pos: *mut mjtNum,
    pub site_quat: *mut mjtNum,
    pub site_user: *mut mjtNum,
    pub site_rgba: *mut f32,
    pub cam_mode: *mut ::std::os::raw::c_int,
    pub cam_bodyid: *mut ::std::os::raw::c_int,
    pub cam_targetbodyid: *mut ::std::os::raw::c_int,
    pub cam_pos: *mut mjtNum,
    pub cam_quat: *mut mjtNum,
    pub cam_poscom0: *mut mjtNum,
    pub cam_pos0: *mut mjtNum,
    pub cam_mat0: *mut mjtNum,
    pub cam_fovy: *mut mjtNum,
    pub cam_ipd: *mut mjtNum,
    pub cam_user: *mut mjtNum,
    pub light_mode: *mut ::std::os::raw::c_int,
    pub light_bodyid: *mut ::std::os::raw::c_int,
    pub light_targetbodyid: *mut ::std::os::raw::c_int,
    pub light_directional: *mut mjtByte,
    pub light_castshadow: *mut mjtByte,
    pub light_active: *mut mjtByte,
    pub light_pos: *mut mjtNum,
    pub light_dir: *mut mjtNum,
    pub light_poscom0: *mut mjtNum,
    pub light_pos0: *mut mjtNum,
    pub light_dir0: *mut mjtNum,
    pub light_attenuation: *mut f32,
    pub light_cutoff: *mut f32,
    pub light_exponent: *mut f32,
    pub light_ambient: *mut f32,
    pub light_diffuse: *mut f32,
    pub light_specular: *mut f32,
    pub mesh_vertadr: *mut ::std::os::raw::c_int,
    pub mesh_vertnum: *mut ::std::os::raw::c_int,
    pub mesh_texcoordadr: *mut ::std::os::raw::c_int,
    pub mesh_faceadr: *mut ::std::os::raw::c_int,
    pub mesh_facenum: *mut ::std::os::raw::c_int,
    pub mesh_graphadr: *mut ::std::os::raw::c_int,
    pub mesh_vert: *mut f32,
    pub mesh_normal: *mut f32,
    pub mesh_texcoord: *mut f32,
    pub mesh_face: *mut ::std::os::raw::c_int,
    pub mesh_graph: *mut ::std::os::raw::c_int,
    pub skin_matid: *mut ::std::os::raw::c_int,
    pub skin_group: *mut ::std::os::raw::c_int,
    pub skin_rgba: *mut f32,
    pub skin_inflate: *mut f32,
    pub skin_vertadr: *mut ::std::os::raw::c_int,
    pub skin_vertnum: *mut ::std::os::raw::c_int,
    pub skin_texcoordadr: *mut ::std::os::raw::c_int,
    pub skin_faceadr: *mut ::std::os::raw::c_int,
    pub skin_facenum: *mut ::std::os::raw::c_int,
    pub skin_boneadr: *mut ::std::os::raw::c_int,
    pub skin_bonenum: *mut ::std::os::raw::c_int,
    pub skin_vert: *mut f32,
    pub skin_texcoord: *mut f32,
    pub skin_face: *mut ::std::os::raw::c_int,
    pub skin_bonevertadr: *mut ::std::os::raw::c_int,
    pub skin_bonevertnum: *mut ::std::os::raw::c_int,
    pub skin_bonebindpos: *mut f32,
    pub skin_bonebindquat: *mut f32,
    pub skin_bonebodyid: *mut ::std::os::raw::c_int,
    pub skin_bonevertid: *mut ::std::os::raw::c_int,
    pub skin_bonevertweight: *mut f32,
    pub hfield_size: *mut mjtNum,
    pub hfield_nrow: *mut ::std::os::raw::c_int,
    pub hfield_ncol: *mut ::std::os::raw::c_int,
    pub hfield_adr: *mut ::std::os::raw::c_int,
    pub hfield_data: *mut f32,
    pub tex_type: *mut ::std::os::raw::c_int,
    pub tex_height: *mut ::std::os::raw::c_int,
    pub tex_width: *mut ::std::os::raw::c_int,
    pub tex_adr: *mut ::std::os::raw::c_int,
    pub tex_rgb: *mut mjtByte,
    pub mat_texid: *mut ::std::os::raw::c_int,
    pub mat_texuniform: *mut mjtByte,
    pub mat_texrepeat: *mut f32,
    pub mat_emission: *mut f32,
    pub mat_specular: *mut f32,
    pub mat_shininess: *mut f32,
    pub mat_reflectance: *mut f32,
    pub mat_rgba: *mut f32,
    pub pair_dim: *mut ::std::os::raw::c_int,
    pub pair_geom1: *mut ::std::os::raw::c_int,
    pub pair_geom2: *mut ::std::os::raw::c_int,
    pub pair_signature: *mut ::std::os::raw::c_int,
    pub pair_solref: *mut mjtNum,
    pub pair_solimp: *mut mjtNum,
    pub pair_margin: *mut mjtNum,
    pub pair_gap: *mut mjtNum,
    pub pair_friction: *mut mjtNum,
    pub exclude_signature: *mut ::std::os::raw::c_int,
    pub eq_type: *mut ::std::os::raw::c_int,
    pub eq_obj1id: *mut ::std::os::raw::c_int,
    pub eq_obj2id: *mut ::std::os::raw::c_int,
    pub eq_active: *mut mjtByte,
    pub eq_solref: *mut mjtNum,
    pub eq_solimp: *mut mjtNum,
    pub eq_data: *mut mjtNum,
    pub tendon_adr: *mut ::std::os::raw::c_int,
    pub tendon_num: *mut ::std::os::raw::c_int,
    pub tendon_matid: *mut ::std::os::raw::c_int,
    pub tendon_group: *mut ::std::os::raw::c_int,
    pub tendon_limited: *mut mjtByte,
    pub tendon_width: *mut mjtNum,
    pub tendon_solref_lim: *mut mjtNum,
    pub tendon_solimp_lim: *mut mjtNum,
    pub tendon_solref_fri: *mut mjtNum,
    pub tendon_solimp_fri: *mut mjtNum,
    pub tendon_range: *mut mjtNum,
    pub tendon_margin: *mut mjtNum,
    pub tendon_stiffness: *mut mjtNum,
    pub tendon_damping: *mut mjtNum,
    pub tendon_frictionloss: *mut mjtNum,
    pub tendon_lengthspring: *mut mjtNum,
    pub tendon_length0: *mut mjtNum,
    pub tendon_invweight0: *mut mjtNum,
    pub tendon_user: *mut mjtNum,
    pub tendon_rgba: *mut f32,
    pub wrap_type: *mut ::std::os::raw::c_int,
    pub wrap_objid: *mut ::std::os::raw::c_int,
    pub wrap_prm: *mut mjtNum,
    pub actuator_trntype: *mut ::std::os::raw::c_int,
    pub actuator_dyntype: *mut ::std::os::raw::c_int,
    pub actuator_gaintype: *mut ::std::os::raw::c_int,
    pub actuator_biastype: *mut ::std::os::raw::c_int,
    pub actuator_trnid: *mut ::std::os::raw::c_int,
    pub actuator_group: *mut ::std::os::raw::c_int,
    pub actuator_ctrllimited: *mut mjtByte,
    pub actuator_forcelimited: *mut mjtByte,
    pub actuator_actlimited: *mut mjtByte,
    pub actuator_dynprm: *mut mjtNum,
    pub actuator_gainprm: *mut mjtNum,
    pub actuator_biasprm: *mut mjtNum,
    pub actuator_ctrlrange: *mut mjtNum,
    pub actuator_forcerange: *mut mjtNum,
    pub actuator_actrange: *mut mjtNum,
    pub actuator_gear: *mut mjtNum,
    pub actuator_cranklength: *mut mjtNum,
    pub actuator_acc0: *mut mjtNum,
    pub actuator_length0: *mut mjtNum,
    pub actuator_lengthrange: *mut mjtNum,
    pub actuator_user: *mut mjtNum,
    pub actuator_plugin: *mut ::std::os::raw::c_int,
    pub sensor_type: *mut ::std::os::raw::c_int,
    pub sensor_datatype: *mut ::std::os::raw::c_int,
    pub sensor_needstage: *mut ::std::os::raw::c_int,
    pub sensor_objtype: *mut ::std::os::raw::c_int,
    pub sensor_objid: *mut ::std::os::raw::c_int,
    pub sensor_reftype: *mut ::std::os::raw::c_int,
    pub sensor_refid: *mut ::std::os::raw::c_int,
    pub sensor_dim: *mut ::std::os::raw::c_int,
    pub sensor_adr: *mut ::std::os::raw::c_int,
    pub sensor_cutoff: *mut mjtNum,
    pub sensor_noise: *mut mjtNum,
    pub sensor_user: *mut mjtNum,
    pub sensor_plugin: *mut ::std::os::raw::c_int,
    pub plugin: *mut ::std::os::raw::c_int,
    pub plugin_stateadr: *mut ::std::os::raw::c_int,
    pub plugin_statenum: *mut ::std::os::raw::c_int,
    pub plugin_attr: *mut ::std::os::raw::c_char,
    pub plugin_attradr: *mut ::std::os::raw::c_int,
    pub numeric_adr: *mut ::std::os::raw::c_int,
    pub numeric_size: *mut ::std::os::raw::c_int,
    pub numeric_data: *mut mjtNum,
    pub text_adr: *mut ::std::os::raw::c_int,
    pub text_size: *mut ::std::os::raw::c_int,
    pub text_data: *mut ::std::os::raw::c_char,
    pub tuple_adr: *mut ::std::os::raw::c_int,
    pub tuple_size: *mut ::std::os::raw::c_int,
    pub tuple_objtype: *mut ::std::os::raw::c_int,
    pub tuple_objid: *mut ::std::os::raw::c_int,
    pub tuple_objprm: *mut mjtNum,
    pub key_time: *mut mjtNum,
    pub key_qpos: *mut mjtNum,
    pub key_qvel: *mut mjtNum,
    pub key_act: *mut mjtNum,
    pub key_mpos: *mut mjtNum,
    pub key_mquat: *mut mjtNum,
    pub key_ctrl: *mut mjtNum,
    pub name_bodyadr: *mut ::std::os::raw::c_int,
    pub name_jntadr: *mut ::std::os::raw::c_int,
    pub name_geomadr: *mut ::std::os::raw::c_int,
    pub name_siteadr: *mut ::std::os::raw::c_int,
    pub name_camadr: *mut ::std::os::raw::c_int,
    pub name_lightadr: *mut ::std::os::raw::c_int,
    pub name_meshadr: *mut ::std::os::raw::c_int,
    pub name_skinadr: *mut ::std::os::raw::c_int,
    pub name_hfieldadr: *mut ::std::os::raw::c_int,
    pub name_texadr: *mut ::std::os::raw::c_int,
    pub name_matadr: *mut ::std::os::raw::c_int,
    pub name_pairadr: *mut ::std::os::raw::c_int,
    pub name_excludeadr: *mut ::std::os::raw::c_int,
    pub name_eqadr: *mut ::std::os::raw::c_int,
    pub name_tendonadr: *mut ::std::os::raw::c_int,
    pub name_actuatoradr: *mut ::std::os::raw::c_int,
    pub name_sensoradr: *mut ::std::os::raw::c_int,
    pub name_numericadr: *mut ::std::os::raw::c_int,
    pub name_textadr: *mut ::std::os::raw::c_int,
    pub name_tupleadr: *mut ::std::os::raw::c_int,
    pub name_keyadr: *mut ::std::os::raw::c_int,
    pub name_pluginadr: *mut ::std::os::raw::c_int,
    pub names: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_mjModel_() {
    const UNINIT: ::std::mem::MaybeUninit<mjModel_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjModel_>(),
        3376usize,
        concat!("Size of: ", stringify!(mjModel_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjModel_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjModel_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nv) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nu) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).na) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(na)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbody) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nbody)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).njnt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(njnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ngeom) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ngeom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsite) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nsite)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ncam) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ncam)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nlight) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nlight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmesh) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmesh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmeshvert) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmeshvert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmeshtexvert) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmeshtexvert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmeshface) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmeshface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmeshgraph) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmeshgraph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskin) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskinvert) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskinvert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskintexvert) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskintexvert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskinface) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskinface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskinbone) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskinbone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskinbonevert) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nskinbonevert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nhfield) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nhfield)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nhfielddata) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nhfielddata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntex) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntexdata) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntexdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmat) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).npair) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(npair)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nexclude) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nexclude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).neq) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(neq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntendon) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntendon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nwrap) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nwrap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsensor) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nsensor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nnumeric) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nnumeric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nnumericdata) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nnumericdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntext) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntextdata) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntextdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntuple) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntuple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntupledata) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(ntupledata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nkey) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nkey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmocap) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nmocap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nplugin) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nplugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).npluginattr) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(npluginattr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_body) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_body)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_jnt) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_jnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_geom) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_geom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_site) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_site)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_cam) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_cam)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_tendon) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_tendon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_actuator) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_actuator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuser_sensor) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuser_sensor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nnames) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nnames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nM) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nD) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nemax) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nemax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).njmax) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(njmax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nconmax) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nconmax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nstack) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nstack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nuserdata) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nuserdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsensordata) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nsensordata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).npluginstate) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(npluginstate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbuffer) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(nbuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vis) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(vis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stat) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(stat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qpos0) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(qpos0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qpos_spring) as usize - ptr as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(qpos_spring)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_parentid) as usize - ptr as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_parentid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_rootid) as usize - ptr as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_rootid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_weldid) as usize - ptr as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_weldid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_mocapid) as usize - ptr as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_mocapid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_jntnum) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_jntnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_jntadr) as usize - ptr as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_jntadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_dofnum) as usize - ptr as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_dofnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_dofadr) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_dofadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_geomnum) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_geomnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_geomadr) as usize - ptr as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_geomadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_simple) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_simple)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_sameframe) as usize - ptr as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_sameframe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_pos) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_quat) as usize - ptr as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_quat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_ipos) as usize - ptr as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_ipos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_iquat) as usize - ptr as usize },
        1256usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_iquat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_mass) as usize - ptr as usize },
        1264usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_mass)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).body_subtreemass) as usize - ptr as usize
        },
        1272usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_subtreemass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_inertia) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_inertia)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_invweight0) as usize - ptr as usize },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_invweight0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_user) as usize - ptr as usize },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).body_plugin) as usize - ptr as usize },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(body_plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_type) as usize - ptr as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_qposadr) as usize - ptr as usize },
        1320usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_qposadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_dofadr) as usize - ptr as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_dofadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_bodyid) as usize - ptr as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_bodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_group) as usize - ptr as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_limited) as usize - ptr as usize },
        1352usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_limited)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_solref) as usize - ptr as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_solimp) as usize - ptr as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_pos) as usize - ptr as usize },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_axis) as usize - ptr as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_stiffness) as usize - ptr as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_stiffness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_range) as usize - ptr as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_margin) as usize - ptr as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_margin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jnt_user) as usize - ptr as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(jnt_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_bodyid) as usize - ptr as usize },
        1424usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_bodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_jntid) as usize - ptr as usize },
        1432usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_jntid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_parentid) as usize - ptr as usize },
        1440usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_parentid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_Madr) as usize - ptr as usize },
        1448usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_Madr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_simplenum) as usize - ptr as usize },
        1456usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_simplenum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_solref) as usize - ptr as usize },
        1464usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_solimp) as usize - ptr as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_solimp)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).dof_frictionloss) as usize - ptr as usize
        },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_frictionloss)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_armature) as usize - ptr as usize },
        1488usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_armature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_damping) as usize - ptr as usize },
        1496usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_damping)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_invweight0) as usize - ptr as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_invweight0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dof_M0) as usize - ptr as usize },
        1512usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(dof_M0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_type) as usize - ptr as usize },
        1520usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_contype) as usize - ptr as usize },
        1528usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_contype)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).geom_conaffinity) as usize - ptr as usize
        },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_conaffinity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_condim) as usize - ptr as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_condim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_bodyid) as usize - ptr as usize },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_bodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_dataid) as usize - ptr as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_dataid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_matid) as usize - ptr as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_matid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_group) as usize - ptr as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_priority) as usize - ptr as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_sameframe) as usize - ptr as usize },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_sameframe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_solmix) as usize - ptr as usize },
        1600usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_solmix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_solref) as usize - ptr as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_solimp) as usize - ptr as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_size) as usize - ptr as usize },
        1624usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_rbound) as usize - ptr as usize },
        1632usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_rbound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_pos) as usize - ptr as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_quat) as usize - ptr as usize },
        1648usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_quat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_friction) as usize - ptr as usize },
        1656usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_friction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_margin) as usize - ptr as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_margin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_gap) as usize - ptr as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_gap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_fluid) as usize - ptr as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_fluid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_user) as usize - ptr as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_rgba) as usize - ptr as usize },
        1696usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(geom_rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_type) as usize - ptr as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_bodyid) as usize - ptr as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_bodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_matid) as usize - ptr as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_matid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_group) as usize - ptr as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_sameframe) as usize - ptr as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_sameframe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_size) as usize - ptr as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_pos) as usize - ptr as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_quat) as usize - ptr as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_quat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_user) as usize - ptr as usize },
        1768usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_rgba) as usize - ptr as usize },
        1776usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(site_rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_mode) as usize - ptr as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_bodyid) as usize - ptr as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_bodyid)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).cam_targetbodyid) as usize - ptr as usize
        },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_targetbodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_pos) as usize - ptr as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_quat) as usize - ptr as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_quat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_poscom0) as usize - ptr as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_poscom0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_pos0) as usize - ptr as usize },
        1832usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_pos0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_mat0) as usize - ptr as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_mat0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_fovy) as usize - ptr as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_fovy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_ipd) as usize - ptr as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_ipd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_user) as usize - ptr as usize },
        1864usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(cam_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_mode) as usize - ptr as usize },
        1872usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_bodyid) as usize - ptr as usize },
        1880usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_bodyid)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).light_targetbodyid) as usize - ptr as usize
        },
        1888usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_targetbodyid)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).light_directional) as usize - ptr as usize
        },
        1896usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_directional)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).light_castshadow) as usize - ptr as usize
        },
        1904usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_castshadow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_active) as usize - ptr as usize },
        1912usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_pos) as usize - ptr as usize },
        1920usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_dir) as usize - ptr as usize },
        1928usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_poscom0) as usize - ptr as usize },
        1936usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_poscom0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_pos0) as usize - ptr as usize },
        1944usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_pos0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_dir0) as usize - ptr as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_dir0)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).light_attenuation) as usize - ptr as usize
        },
        1960usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_attenuation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_cutoff) as usize - ptr as usize },
        1968usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_cutoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_exponent) as usize - ptr as usize },
        1976usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_exponent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_ambient) as usize - ptr as usize },
        1984usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_ambient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_diffuse) as usize - ptr as usize },
        1992usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_diffuse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_specular) as usize - ptr as usize },
        2000usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(light_specular)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_vertadr) as usize - ptr as usize },
        2008usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_vertadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_vertnum) as usize - ptr as usize },
        2016usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_vertnum)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).mesh_texcoordadr) as usize - ptr as usize
        },
        2024usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_texcoordadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_faceadr) as usize - ptr as usize },
        2032usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_faceadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_facenum) as usize - ptr as usize },
        2040usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_facenum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_graphadr) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_graphadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_vert) as usize - ptr as usize },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_vert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_normal) as usize - ptr as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_normal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_texcoord) as usize - ptr as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_texcoord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_face) as usize - ptr as usize },
        2080usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_face)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mesh_graph) as usize - ptr as usize },
        2088usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mesh_graph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_matid) as usize - ptr as usize },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_matid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_group) as usize - ptr as usize },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_rgba) as usize - ptr as usize },
        2112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_inflate) as usize - ptr as usize },
        2120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_inflate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_vertadr) as usize - ptr as usize },
        2128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_vertadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_vertnum) as usize - ptr as usize },
        2136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_vertnum)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_texcoordadr) as usize - ptr as usize
        },
        2144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_texcoordadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_faceadr) as usize - ptr as usize },
        2152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_faceadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_facenum) as usize - ptr as usize },
        2160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_facenum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_boneadr) as usize - ptr as usize },
        2168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_boneadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_bonenum) as usize - ptr as usize },
        2176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonenum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_vert) as usize - ptr as usize },
        2184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_vert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_texcoord) as usize - ptr as usize },
        2192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_texcoord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_face) as usize - ptr as usize },
        2200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_face)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_bonevertadr) as usize - ptr as usize
        },
        2208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonevertadr)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_bonevertnum) as usize - ptr as usize
        },
        2216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonevertnum)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_bonebindpos) as usize - ptr as usize
        },
        2224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonebindpos)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_bonebindquat) as usize - ptr as usize
        },
        2232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonebindquat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_bonebodyid) as usize - ptr as usize },
        2240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonebodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skin_bonevertid) as usize - ptr as usize },
        2248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonevertid)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).skin_bonevertweight) as usize - ptr as usize
        },
        2256usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(skin_bonevertweight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hfield_size) as usize - ptr as usize },
        2264usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(hfield_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hfield_nrow) as usize - ptr as usize },
        2272usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(hfield_nrow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hfield_ncol) as usize - ptr as usize },
        2280usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(hfield_ncol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hfield_adr) as usize - ptr as usize },
        2288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(hfield_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hfield_data) as usize - ptr as usize },
        2296usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(hfield_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tex_type) as usize - ptr as usize },
        2304usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tex_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tex_height) as usize - ptr as usize },
        2312usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tex_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tex_width) as usize - ptr as usize },
        2320usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tex_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tex_adr) as usize - ptr as usize },
        2328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tex_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tex_rgb) as usize - ptr as usize },
        2336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tex_rgb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_texid) as usize - ptr as usize },
        2344usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_texid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_texuniform) as usize - ptr as usize },
        2352usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_texuniform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_texrepeat) as usize - ptr as usize },
        2360usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_texrepeat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_emission) as usize - ptr as usize },
        2368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_emission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_specular) as usize - ptr as usize },
        2376usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_specular)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_shininess) as usize - ptr as usize },
        2384usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_shininess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_reflectance) as usize - ptr as usize },
        2392usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_reflectance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat_rgba) as usize - ptr as usize },
        2400usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(mat_rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_dim) as usize - ptr as usize },
        2408usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_dim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_geom1) as usize - ptr as usize },
        2416usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_geom1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_geom2) as usize - ptr as usize },
        2424usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_geom2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_signature) as usize - ptr as usize },
        2432usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_signature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_solref) as usize - ptr as usize },
        2440usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_solimp) as usize - ptr as usize },
        2448usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_margin) as usize - ptr as usize },
        2456usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_margin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_gap) as usize - ptr as usize },
        2464usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_gap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pair_friction) as usize - ptr as usize },
        2472usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(pair_friction)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).exclude_signature) as usize - ptr as usize
        },
        2480usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(exclude_signature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_type) as usize - ptr as usize },
        2488usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_obj1id) as usize - ptr as usize },
        2496usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_obj1id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_obj2id) as usize - ptr as usize },
        2504usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_obj2id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_active) as usize - ptr as usize },
        2512usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_solref) as usize - ptr as usize },
        2520usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_solimp) as usize - ptr as usize },
        2528usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eq_data) as usize - ptr as usize },
        2536usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(eq_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_adr) as usize - ptr as usize },
        2544usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_num) as usize - ptr as usize },
        2552usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_matid) as usize - ptr as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_matid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_group) as usize - ptr as usize },
        2568usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_limited) as usize - ptr as usize },
        2576usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_limited)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_width) as usize - ptr as usize },
        2584usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_width)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_solref_lim) as usize - ptr as usize
        },
        2592usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_solref_lim)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_solimp_lim) as usize - ptr as usize
        },
        2600usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_solimp_lim)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_solref_fri) as usize - ptr as usize
        },
        2608usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_solref_fri)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_solimp_fri) as usize - ptr as usize
        },
        2616usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_solimp_fri)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_range) as usize - ptr as usize },
        2624usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_margin) as usize - ptr as usize },
        2632usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_margin)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_stiffness) as usize - ptr as usize
        },
        2640usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_stiffness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_damping) as usize - ptr as usize },
        2648usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_damping)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_frictionloss) as usize - ptr as usize
        },
        2656usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_frictionloss)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_lengthspring) as usize - ptr as usize
        },
        2664usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_lengthspring)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_length0) as usize - ptr as usize },
        2672usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_length0)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).tendon_invweight0) as usize - ptr as usize
        },
        2680usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_invweight0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_user) as usize - ptr as usize },
        2688usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tendon_rgba) as usize - ptr as usize },
        2696usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tendon_rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrap_type) as usize - ptr as usize },
        2704usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(wrap_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrap_objid) as usize - ptr as usize },
        2712usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(wrap_objid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrap_prm) as usize - ptr as usize },
        2720usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(wrap_prm)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_trntype) as usize - ptr as usize
        },
        2728usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_trntype)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_dyntype) as usize - ptr as usize
        },
        2736usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_dyntype)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_gaintype) as usize - ptr as usize
        },
        2744usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_gaintype)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_biastype) as usize - ptr as usize
        },
        2752usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_biastype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_trnid) as usize - ptr as usize },
        2760usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_trnid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_group) as usize - ptr as usize },
        2768usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_group)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_ctrllimited) as usize - ptr as usize
        },
        2776usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_ctrllimited)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_forcelimited) as usize - ptr as usize
        },
        2784usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_forcelimited)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_actlimited) as usize - ptr as usize
        },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_actlimited)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_dynprm) as usize - ptr as usize },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_dynprm)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_gainprm) as usize - ptr as usize
        },
        2808usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_gainprm)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_biasprm) as usize - ptr as usize
        },
        2816usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_biasprm)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_ctrlrange) as usize - ptr as usize
        },
        2824usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_ctrlrange)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_forcerange) as usize - ptr as usize
        },
        2832usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_forcerange)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_actrange) as usize - ptr as usize
        },
        2840usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_actrange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_gear) as usize - ptr as usize },
        2848usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_gear)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_cranklength) as usize - ptr as usize
        },
        2856usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_cranklength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_acc0) as usize - ptr as usize },
        2864usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_acc0)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_length0) as usize - ptr as usize
        },
        2872usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_length0)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_lengthrange) as usize - ptr as usize
        },
        2880usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_lengthrange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_user) as usize - ptr as usize },
        2888usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_plugin) as usize - ptr as usize },
        2896usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(actuator_plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_type) as usize - ptr as usize },
        2904usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_datatype) as usize - ptr as usize },
        2912usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_datatype)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).sensor_needstage) as usize - ptr as usize
        },
        2920usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_needstage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_objtype) as usize - ptr as usize },
        2928usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_objtype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_objid) as usize - ptr as usize },
        2936usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_objid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_reftype) as usize - ptr as usize },
        2944usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_reftype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_refid) as usize - ptr as usize },
        2952usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_refid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_dim) as usize - ptr as usize },
        2960usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_dim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_adr) as usize - ptr as usize },
        2968usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_cutoff) as usize - ptr as usize },
        2976usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_cutoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_noise) as usize - ptr as usize },
        2984usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_noise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_user) as usize - ptr as usize },
        2992usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensor_plugin) as usize - ptr as usize },
        3000usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(sensor_plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin) as usize - ptr as usize },
        3008usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_stateadr) as usize - ptr as usize },
        3016usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(plugin_stateadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_statenum) as usize - ptr as usize },
        3024usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(plugin_statenum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_attr) as usize - ptr as usize },
        3032usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(plugin_attr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_attradr) as usize - ptr as usize },
        3040usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(plugin_attradr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numeric_adr) as usize - ptr as usize },
        3048usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(numeric_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numeric_size) as usize - ptr as usize },
        3056usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(numeric_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numeric_data) as usize - ptr as usize },
        3064usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(numeric_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_adr) as usize - ptr as usize },
        3072usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(text_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_size) as usize - ptr as usize },
        3080usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(text_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_data) as usize - ptr as usize },
        3088usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(text_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuple_adr) as usize - ptr as usize },
        3096usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tuple_adr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuple_size) as usize - ptr as usize },
        3104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tuple_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuple_objtype) as usize - ptr as usize },
        3112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tuple_objtype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuple_objid) as usize - ptr as usize },
        3120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tuple_objid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuple_objprm) as usize - ptr as usize },
        3128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(tuple_objprm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_time) as usize - ptr as usize },
        3136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_qpos) as usize - ptr as usize },
        3144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_qpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_qvel) as usize - ptr as usize },
        3152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_qvel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_act) as usize - ptr as usize },
        3160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_act)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_mpos) as usize - ptr as usize },
        3168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_mpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_mquat) as usize - ptr as usize },
        3176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_mquat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_ctrl) as usize - ptr as usize },
        3184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(key_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_bodyadr) as usize - ptr as usize },
        3192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_bodyadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_jntadr) as usize - ptr as usize },
        3200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_jntadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_geomadr) as usize - ptr as usize },
        3208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_geomadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_siteadr) as usize - ptr as usize },
        3216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_siteadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_camadr) as usize - ptr as usize },
        3224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_camadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_lightadr) as usize - ptr as usize },
        3232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_lightadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_meshadr) as usize - ptr as usize },
        3240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_meshadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_skinadr) as usize - ptr as usize },
        3248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_skinadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_hfieldadr) as usize - ptr as usize },
        3256usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_hfieldadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_texadr) as usize - ptr as usize },
        3264usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_texadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_matadr) as usize - ptr as usize },
        3272usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_matadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_pairadr) as usize - ptr as usize },
        3280usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_pairadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_excludeadr) as usize - ptr as usize },
        3288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_excludeadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_eqadr) as usize - ptr as usize },
        3296usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_eqadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_tendonadr) as usize - ptr as usize },
        3304usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_tendonadr)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).name_actuatoradr) as usize - ptr as usize
        },
        3312usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_actuatoradr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_sensoradr) as usize - ptr as usize },
        3320usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_sensoradr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_numericadr) as usize - ptr as usize },
        3328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_numericadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_textadr) as usize - ptr as usize },
        3336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_textadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_tupleadr) as usize - ptr as usize },
        3344usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_tupleadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_keyadr) as usize - ptr as usize },
        3352usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_keyadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name_pluginadr) as usize - ptr as usize },
        3360usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(name_pluginadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).names) as usize - ptr as usize },
        3368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjModel_),
            "::",
            stringify!(names)
        )
    );
}
impl Default for mjModel_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjModel = mjModel_;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtWarning_ {
    INERTIA = 0,
    CONTACTFULL = 1,
    CNSTRFULL = 2,
    VGEOMFULL = 3,
    BADQPOS = 4,
    BADQVEL = 5,
    BADQACC = 6,
    BADCTRL = 7,
    mjNWARNING = 8,
}
pub use self::mjtWarning_ as mjtWarning;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtTimer_ {
    STEP = 0,
    FORWARD = 1,
    INVERSE = 2,
    POSITION = 3,
    VELOCITY = 4,
    ACTUATION = 5,
    ACCELERATION = 6,
    CONSTRAINT = 7,
    POS_KINEMATICS = 8,
    POS_INERTIA = 9,
    POS_COLLISION = 10,
    POS_MAKE = 11,
    POS_PROJECT = 12,
    mjNTIMER = 13,
}
pub use self::mjtTimer_ as mjtTimer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjContact_ {
    pub dist: mjtNum,
    pub pos: [mjtNum; 3usize],
    pub frame: [mjtNum; 9usize],
    pub includemargin: mjtNum,
    pub friction: [mjtNum; 5usize],
    pub solref: [mjtNum; 2usize],
    pub solimp: [mjtNum; 5usize],
    pub mu: mjtNum,
    pub H: [mjtNum; 36usize],
    pub dim: ::std::os::raw::c_int,
    pub geom1: ::std::os::raw::c_int,
    pub geom2: ::std::os::raw::c_int,
    pub exclude: ::std::os::raw::c_int,
    pub efc_address: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjContact_() {
    const UNINIT: ::std::mem::MaybeUninit<mjContact_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjContact_>(),
        528usize,
        concat!("Size of: ", stringify!(mjContact_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjContact_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjContact_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dist) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(dist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).includemargin) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(includemargin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).friction) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(friction)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solref) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(solref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solimp) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(solimp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mu) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(mu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).H) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(H)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dim) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(dim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom1) as usize - ptr as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(geom1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom2) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(geom2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exclude) as usize - ptr as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(exclude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_address) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(mjContact_),
            "::",
            stringify!(efc_address)
        )
    );
}
impl Default for mjContact_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjContact = mjContact_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjWarningStat_ {
    pub lastinfo: ::std::os::raw::c_int,
    pub number: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjWarningStat_() {
    const UNINIT: ::std::mem::MaybeUninit<mjWarningStat_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjWarningStat_>(),
        8usize,
        concat!("Size of: ", stringify!(mjWarningStat_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjWarningStat_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjWarningStat_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjWarningStat_),
            "::",
            stringify!(lastinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjWarningStat_),
            "::",
            stringify!(number)
        )
    );
}
pub type mjWarningStat = mjWarningStat_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjTimerStat_ {
    pub duration: mjtNum,
    pub number: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjTimerStat_() {
    const UNINIT: ::std::mem::MaybeUninit<mjTimerStat_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjTimerStat_>(),
        16usize,
        concat!("Size of: ", stringify!(mjTimerStat_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjTimerStat_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjTimerStat_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjTimerStat_),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjTimerStat_),
            "::",
            stringify!(number)
        )
    );
}
pub type mjTimerStat = mjTimerStat_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjSolverStat_ {
    pub improvement: mjtNum,
    pub gradient: mjtNum,
    pub lineslope: mjtNum,
    pub nactive: ::std::os::raw::c_int,
    pub nchange: ::std::os::raw::c_int,
    pub neval: ::std::os::raw::c_int,
    pub nupdate: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjSolverStat_() {
    const UNINIT: ::std::mem::MaybeUninit<mjSolverStat_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjSolverStat_>(),
        40usize,
        concat!("Size of: ", stringify!(mjSolverStat_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjSolverStat_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjSolverStat_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).improvement) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(improvement)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gradient) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(gradient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineslope) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(lineslope)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nactive) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(nactive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nchange) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(nchange)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).neval) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(neval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nupdate) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjSolverStat_),
            "::",
            stringify!(nupdate)
        )
    );
}
pub type mjSolverStat = mjSolverStat_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjData_ {
    pub nstack: ::std::os::raw::c_int,
    pub nbuffer: ::std::os::raw::c_int,
    pub nplugin: ::std::os::raw::c_int,
    pub pstack: usize,
    pub parena: usize,
    pub maxuse_stack: ::std::os::raw::c_int,
    pub maxuse_arena: usize,
    pub maxuse_con: ::std::os::raw::c_int,
    pub maxuse_efc: ::std::os::raw::c_int,
    pub warning: [mjWarningStat; 8usize],
    pub timer: [mjTimerStat; 13usize],
    pub solver: [mjSolverStat; 1000usize],
    pub solver_iter: ::std::os::raw::c_int,
    pub solver_nnz: ::std::os::raw::c_int,
    pub solver_fwdinv: [mjtNum; 2usize],
    pub ne: ::std::os::raw::c_int,
    pub nf: ::std::os::raw::c_int,
    pub nefc: ::std::os::raw::c_int,
    pub ncon: ::std::os::raw::c_int,
    pub time: mjtNum,
    pub energy: [mjtNum; 2usize],
    pub buffer: *mut ::std::os::raw::c_void,
    pub arena: *mut ::std::os::raw::c_void,
    pub qpos: *mut mjtNum,
    pub qvel: *mut mjtNum,
    pub act: *mut mjtNum,
    pub qacc_warmstart: *mut mjtNum,
    pub plugin_state: *mut mjtNum,
    pub ctrl: *mut mjtNum,
    pub qfrc_applied: *mut mjtNum,
    pub xfrc_applied: *mut mjtNum,
    pub mocap_pos: *mut mjtNum,
    pub mocap_quat: *mut mjtNum,
    pub qacc: *mut mjtNum,
    pub act_dot: *mut mjtNum,
    pub userdata: *mut mjtNum,
    pub sensordata: *mut mjtNum,
    pub plugin: *mut ::std::os::raw::c_int,
    pub plugin_data: *mut usize,
    pub xpos: *mut mjtNum,
    pub xquat: *mut mjtNum,
    pub xmat: *mut mjtNum,
    pub xipos: *mut mjtNum,
    pub ximat: *mut mjtNum,
    pub xanchor: *mut mjtNum,
    pub xaxis: *mut mjtNum,
    pub geom_xpos: *mut mjtNum,
    pub geom_xmat: *mut mjtNum,
    pub site_xpos: *mut mjtNum,
    pub site_xmat: *mut mjtNum,
    pub cam_xpos: *mut mjtNum,
    pub cam_xmat: *mut mjtNum,
    pub light_xpos: *mut mjtNum,
    pub light_xdir: *mut mjtNum,
    pub subtree_com: *mut mjtNum,
    pub cdof: *mut mjtNum,
    pub cinert: *mut mjtNum,
    pub ten_wrapadr: *mut ::std::os::raw::c_int,
    pub ten_wrapnum: *mut ::std::os::raw::c_int,
    pub ten_J_rownnz: *mut ::std::os::raw::c_int,
    pub ten_J_rowadr: *mut ::std::os::raw::c_int,
    pub ten_J_colind: *mut ::std::os::raw::c_int,
    pub ten_length: *mut mjtNum,
    pub ten_J: *mut mjtNum,
    pub wrap_obj: *mut ::std::os::raw::c_int,
    pub wrap_xpos: *mut mjtNum,
    pub actuator_length: *mut mjtNum,
    pub actuator_moment: *mut mjtNum,
    pub crb: *mut mjtNum,
    pub qM: *mut mjtNum,
    pub qLD: *mut mjtNum,
    pub qLDiagInv: *mut mjtNum,
    pub qLDiagSqrtInv: *mut mjtNum,
    pub ten_velocity: *mut mjtNum,
    pub actuator_velocity: *mut mjtNum,
    pub cvel: *mut mjtNum,
    pub cdof_dot: *mut mjtNum,
    pub qfrc_bias: *mut mjtNum,
    pub qfrc_passive: *mut mjtNum,
    pub efc_vel: *mut mjtNum,
    pub efc_aref: *mut mjtNum,
    pub subtree_linvel: *mut mjtNum,
    pub subtree_angmom: *mut mjtNum,
    pub qH: *mut mjtNum,
    pub qHDiagInv: *mut mjtNum,
    pub D_rownnz: *mut ::std::os::raw::c_int,
    pub D_rowadr: *mut ::std::os::raw::c_int,
    pub D_colind: *mut ::std::os::raw::c_int,
    pub qDeriv: *mut mjtNum,
    pub qLU: *mut mjtNum,
    pub actuator_force: *mut mjtNum,
    pub qfrc_actuator: *mut mjtNum,
    pub qfrc_smooth: *mut mjtNum,
    pub qacc_smooth: *mut mjtNum,
    pub qfrc_constraint: *mut mjtNum,
    pub qfrc_inverse: *mut mjtNum,
    pub cacc: *mut mjtNum,
    pub cfrc_int: *mut mjtNum,
    pub cfrc_ext: *mut mjtNum,
    pub contact: *mut mjContact,
    pub efc_type: *mut ::std::os::raw::c_int,
    pub efc_id: *mut ::std::os::raw::c_int,
    pub efc_J_rownnz: *mut ::std::os::raw::c_int,
    pub efc_J_rowadr: *mut ::std::os::raw::c_int,
    pub efc_J_rowsuper: *mut ::std::os::raw::c_int,
    pub efc_J_colind: *mut ::std::os::raw::c_int,
    pub efc_JT_rownnz: *mut ::std::os::raw::c_int,
    pub efc_JT_rowadr: *mut ::std::os::raw::c_int,
    pub efc_JT_rowsuper: *mut ::std::os::raw::c_int,
    pub efc_JT_colind: *mut ::std::os::raw::c_int,
    pub efc_J: *mut mjtNum,
    pub efc_JT: *mut mjtNum,
    pub efc_pos: *mut mjtNum,
    pub efc_margin: *mut mjtNum,
    pub efc_frictionloss: *mut mjtNum,
    pub efc_diagApprox: *mut mjtNum,
    pub efc_KBIP: *mut mjtNum,
    pub efc_D: *mut mjtNum,
    pub efc_R: *mut mjtNum,
    pub efc_b: *mut mjtNum,
    pub efc_force: *mut mjtNum,
    pub efc_state: *mut ::std::os::raw::c_int,
    pub efc_AR_rownnz: *mut ::std::os::raw::c_int,
    pub efc_AR_rowadr: *mut ::std::os::raw::c_int,
    pub efc_AR_colind: *mut ::std::os::raw::c_int,
    pub efc_AR: *mut mjtNum,
}
#[test]
fn bindgen_test_layout_mjData_() {
    const UNINIT: ::std::mem::MaybeUninit<mjData_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjData_>(),
        41232usize,
        concat!("Size of: ", stringify!(mjData_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjData_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjData_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nstack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(nstack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbuffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(nbuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nplugin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(nplugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstack) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(pstack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parena) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(parena)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxuse_stack) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(maxuse_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxuse_arena) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(maxuse_arena)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxuse_con) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(maxuse_con)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxuse_efc) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(maxuse_efc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warning) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(warning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timer) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solver) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(solver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solver_iter) as usize - ptr as usize },
        40328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(solver_iter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solver_nnz) as usize - ptr as usize },
        40332usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(solver_nnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solver_fwdinv) as usize - ptr as usize },
        40336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(solver_fwdinv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ne) as usize - ptr as usize },
        40352usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ne)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nf) as usize - ptr as usize },
        40356usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(nf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nefc) as usize - ptr as usize },
        40360usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(nefc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ncon) as usize - ptr as usize },
        40364usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ncon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        40368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).energy) as usize - ptr as usize },
        40376usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(energy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        40392usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arena) as usize - ptr as usize },
        40400usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(arena)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qpos) as usize - ptr as usize },
        40408usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qvel) as usize - ptr as usize },
        40416usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qvel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).act) as usize - ptr as usize },
        40424usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(act)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qacc_warmstart) as usize - ptr as usize },
        40432usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qacc_warmstart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_state) as usize - ptr as usize },
        40440usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(plugin_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl) as usize - ptr as usize },
        40448usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_applied) as usize - ptr as usize },
        40456usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_applied)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xfrc_applied) as usize - ptr as usize },
        40464usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xfrc_applied)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mocap_pos) as usize - ptr as usize },
        40472usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(mocap_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mocap_quat) as usize - ptr as usize },
        40480usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(mocap_quat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qacc) as usize - ptr as usize },
        40488usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).act_dot) as usize - ptr as usize },
        40496usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(act_dot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        40504usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sensordata) as usize - ptr as usize },
        40512usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(sensordata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin) as usize - ptr as usize },
        40520usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin_data) as usize - ptr as usize },
        40528usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(plugin_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpos) as usize - ptr as usize },
        40536usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xquat) as usize - ptr as usize },
        40544usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xquat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmat) as usize - ptr as usize },
        40552usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xmat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xipos) as usize - ptr as usize },
        40560usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xipos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ximat) as usize - ptr as usize },
        40568usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ximat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xanchor) as usize - ptr as usize },
        40576usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xanchor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xaxis) as usize - ptr as usize },
        40584usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(xaxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_xpos) as usize - ptr as usize },
        40592usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(geom_xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).geom_xmat) as usize - ptr as usize },
        40600usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(geom_xmat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_xpos) as usize - ptr as usize },
        40608usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(site_xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).site_xmat) as usize - ptr as usize },
        40616usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(site_xmat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_xpos) as usize - ptr as usize },
        40624usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cam_xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cam_xmat) as usize - ptr as usize },
        40632usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cam_xmat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_xpos) as usize - ptr as usize },
        40640usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(light_xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).light_xdir) as usize - ptr as usize },
        40648usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(light_xdir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subtree_com) as usize - ptr as usize },
        40656usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(subtree_com)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdof) as usize - ptr as usize },
        40664usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cdof)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cinert) as usize - ptr as usize },
        40672usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cinert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_wrapadr) as usize - ptr as usize },
        40680usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_wrapadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_wrapnum) as usize - ptr as usize },
        40688usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_wrapnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_J_rownnz) as usize - ptr as usize },
        40696usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_J_rownnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_J_rowadr) as usize - ptr as usize },
        40704usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_J_rowadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_J_colind) as usize - ptr as usize },
        40712usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_J_colind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_length) as usize - ptr as usize },
        40720usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_J) as usize - ptr as usize },
        40728usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_J)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrap_obj) as usize - ptr as usize },
        40736usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(wrap_obj)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wrap_xpos) as usize - ptr as usize },
        40744usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(wrap_xpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_length) as usize - ptr as usize },
        40752usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(actuator_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_moment) as usize - ptr as usize },
        40760usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(actuator_moment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crb) as usize - ptr as usize },
        40768usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(crb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qM) as usize - ptr as usize },
        40776usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qLD) as usize - ptr as usize },
        40784usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qLD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qLDiagInv) as usize - ptr as usize },
        40792usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qLDiagInv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qLDiagSqrtInv) as usize - ptr as usize },
        40800usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qLDiagSqrtInv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ten_velocity) as usize - ptr as usize },
        40808usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(ten_velocity)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).actuator_velocity) as usize - ptr as usize
        },
        40816usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(actuator_velocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cvel) as usize - ptr as usize },
        40824usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cvel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdof_dot) as usize - ptr as usize },
        40832usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cdof_dot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_bias) as usize - ptr as usize },
        40840usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_bias)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_passive) as usize - ptr as usize },
        40848usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_passive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_vel) as usize - ptr as usize },
        40856usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_vel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_aref) as usize - ptr as usize },
        40864usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_aref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subtree_linvel) as usize - ptr as usize },
        40872usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(subtree_linvel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subtree_angmom) as usize - ptr as usize },
        40880usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(subtree_angmom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qH) as usize - ptr as usize },
        40888usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qHDiagInv) as usize - ptr as usize },
        40896usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qHDiagInv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).D_rownnz) as usize - ptr as usize },
        40904usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(D_rownnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).D_rowadr) as usize - ptr as usize },
        40912usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(D_rowadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).D_colind) as usize - ptr as usize },
        40920usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(D_colind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qDeriv) as usize - ptr as usize },
        40928usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qDeriv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qLU) as usize - ptr as usize },
        40936usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qLU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actuator_force) as usize - ptr as usize },
        40944usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(actuator_force)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_actuator) as usize - ptr as usize },
        40952usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_actuator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_smooth) as usize - ptr as usize },
        40960usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_smooth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qacc_smooth) as usize - ptr as usize },
        40968usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qacc_smooth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_constraint) as usize - ptr as usize },
        40976usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_constraint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qfrc_inverse) as usize - ptr as usize },
        40984usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(qfrc_inverse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cacc) as usize - ptr as usize },
        40992usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cfrc_int) as usize - ptr as usize },
        41000usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cfrc_int)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cfrc_ext) as usize - ptr as usize },
        41008usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(cfrc_ext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contact) as usize - ptr as usize },
        41016usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(contact)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_type) as usize - ptr as usize },
        41024usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_id) as usize - ptr as usize },
        41032usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_J_rownnz) as usize - ptr as usize },
        41040usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_J_rownnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_J_rowadr) as usize - ptr as usize },
        41048usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_J_rowadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_J_rowsuper) as usize - ptr as usize },
        41056usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_J_rowsuper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_J_colind) as usize - ptr as usize },
        41064usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_J_colind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_JT_rownnz) as usize - ptr as usize },
        41072usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_JT_rownnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_JT_rowadr) as usize - ptr as usize },
        41080usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_JT_rowadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_JT_rowsuper) as usize - ptr as usize },
        41088usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_JT_rowsuper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_JT_colind) as usize - ptr as usize },
        41096usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_JT_colind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_J) as usize - ptr as usize },
        41104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_J)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_JT) as usize - ptr as usize },
        41112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_JT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_pos) as usize - ptr as usize },
        41120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_margin) as usize - ptr as usize },
        41128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_margin)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).efc_frictionloss) as usize - ptr as usize
        },
        41136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_frictionloss)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_diagApprox) as usize - ptr as usize },
        41144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_diagApprox)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_KBIP) as usize - ptr as usize },
        41152usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_KBIP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_D) as usize - ptr as usize },
        41160usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_D)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_R) as usize - ptr as usize },
        41168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_R)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_b) as usize - ptr as usize },
        41176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_force) as usize - ptr as usize },
        41184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_force)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_state) as usize - ptr as usize },
        41192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_AR_rownnz) as usize - ptr as usize },
        41200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_AR_rownnz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_AR_rowadr) as usize - ptr as usize },
        41208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_AR_rowadr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_AR_colind) as usize - ptr as usize },
        41216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_AR_colind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).efc_AR) as usize - ptr as usize },
        41224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjData_),
            "::",
            stringify!(efc_AR)
        )
    );
}
impl Default for mjData_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjData = mjData_;
pub type mjfGeneric =
    ::std::option::Option<unsafe extern "C" fn(m: *const mjModel, d: *mut mjData)>;
pub type mjfConFilt = ::std::option::Option<
    unsafe extern "C" fn(
        m: *const mjModel,
        d: *mut mjData,
        geom1: ::std::os::raw::c_int,
        geom2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type mjfSensor = ::std::option::Option<
    unsafe extern "C" fn(
        m: *const mjModel,
        d: *mut mjData,
        stage: ::std::os::raw::c_int,
    ),
>;
pub type mjfTime = ::std::option::Option<unsafe extern "C" fn() -> mjtNum>;
pub type mjfAct = ::std::option::Option<
    unsafe extern "C" fn(
        m: *const mjModel,
        d: *const mjData,
        id: ::std::os::raw::c_int,
    ) -> mjtNum,
>;
pub type mjfCollision = ::std::option::Option<
    unsafe extern "C" fn(
        m: *const mjModel,
        d: *const mjData,
        con: *mut mjContact,
        g1: ::std::os::raw::c_int,
        g2: ::std::os::raw::c_int,
        margin: mjtNum,
    ) -> ::std::os::raw::c_int,
>;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtPluginTypeBit_ {
    ACTUATOR = 1,
    SENSOR = 2,
    PASSIVE = 4,
}
pub use self::mjtPluginTypeBit_ as mjtPluginTypeBit;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjpPlugin_ {
    pub name: *const ::std::os::raw::c_char,
    pub nattribute: ::std::os::raw::c_int,
    pub attributes: *const *const ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_int,
    pub needstage: ::std::os::raw::c_int,
    pub nstate: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            instance: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub nsensordata: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            instance: ::std::os::raw::c_int,
            sensor_id: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            d: *mut mjData,
            instance: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(d: *mut mjData, instance: ::std::os::raw::c_int),
    >,
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(
            dest: *mut mjData,
            m: *const mjModel,
            src: *const mjData,
            instance: ::std::os::raw::c_int,
        ),
    >,
    pub reset: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            d: *mut mjData,
            instance: ::std::os::raw::c_int,
        ),
    >,
    pub compute: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            d: *mut mjData,
            instance: ::std::os::raw::c_int,
            type_: ::std::os::raw::c_int,
        ),
    >,
    pub advance: ::std::option::Option<
        unsafe extern "C" fn(
            m: *const mjModel,
            d: *mut mjData,
            instance: ::std::os::raw::c_int,
        ),
    >,
}
#[test]
fn bindgen_test_layout_mjpPlugin_() {
    const UNINIT: ::std::mem::MaybeUninit<mjpPlugin_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjpPlugin_>(),
        96usize,
        concat!("Size of: ", stringify!(mjpPlugin_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjpPlugin_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjpPlugin_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nattribute) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(nattribute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).needstage) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(needstage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nstate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(nstate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsensordata) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(nsensordata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compute) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(compute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).advance) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(mjpPlugin_),
            "::",
            stringify!(advance)
        )
    );
}
impl Default for mjpPlugin_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjpPlugin = mjpPlugin_;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtGridPos_ {
    TOPLEFT = 0,
    TOPRIGHT = 1,
    BOTTOMLEFT = 2,
    BOTTOMRIGHT = 3,
}
pub use self::mjtGridPos_ as mjtGridPos;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtFramebuffer_ {
    WINDOW = 0,
    OFFSCREEN = 1,
}
pub use self::mjtFramebuffer_ as mjtFramebuffer;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtFontScale_ {
    SCALE_50 = 50,
    SCALE_100 = 100,
    SCALE_150 = 150,
    SCALE_200 = 200,
    SCALE_250 = 250,
    SCALE_300 = 300,
}
pub use self::mjtFontScale_ as mjtFontScale;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtFont_ {
    NORMAL = 0,
    SHADOW = 1,
    BIG = 2,
}
pub use self::mjtFont_ as mjtFont;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjrRect_ {
    pub left: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjrRect_() {
    const UNINIT: ::std::mem::MaybeUninit<mjrRect_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjrRect_>(),
        16usize,
        concat!("Size of: ", stringify!(mjrRect_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjrRect_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjrRect_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrRect_),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bottom) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrRect_),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrRect_),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrRect_),
            "::",
            stringify!(height)
        )
    );
}
pub type mjrRect = mjrRect_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjrContext_ {
    pub lineWidth: f32,
    pub shadowClip: f32,
    pub shadowScale: f32,
    pub fogStart: f32,
    pub fogEnd: f32,
    pub fogRGBA: [f32; 4usize],
    pub shadowSize: ::std::os::raw::c_int,
    pub offWidth: ::std::os::raw::c_int,
    pub offHeight: ::std::os::raw::c_int,
    pub offSamples: ::std::os::raw::c_int,
    pub fontScale: ::std::os::raw::c_int,
    pub auxWidth: [::std::os::raw::c_int; 10usize],
    pub auxHeight: [::std::os::raw::c_int; 10usize],
    pub auxSamples: [::std::os::raw::c_int; 10usize],
    pub offFBO: ::std::os::raw::c_uint,
    pub offFBO_r: ::std::os::raw::c_uint,
    pub offColor: ::std::os::raw::c_uint,
    pub offColor_r: ::std::os::raw::c_uint,
    pub offDepthStencil: ::std::os::raw::c_uint,
    pub offDepthStencil_r: ::std::os::raw::c_uint,
    pub shadowFBO: ::std::os::raw::c_uint,
    pub shadowTex: ::std::os::raw::c_uint,
    pub auxFBO: [::std::os::raw::c_uint; 10usize],
    pub auxFBO_r: [::std::os::raw::c_uint; 10usize],
    pub auxColor: [::std::os::raw::c_uint; 10usize],
    pub auxColor_r: [::std::os::raw::c_uint; 10usize],
    pub ntexture: ::std::os::raw::c_int,
    pub textureType: [::std::os::raw::c_int; 100usize],
    pub texture: [::std::os::raw::c_uint; 100usize],
    pub basePlane: ::std::os::raw::c_uint,
    pub baseMesh: ::std::os::raw::c_uint,
    pub baseHField: ::std::os::raw::c_uint,
    pub baseBuiltin: ::std::os::raw::c_uint,
    pub baseFontNormal: ::std::os::raw::c_uint,
    pub baseFontShadow: ::std::os::raw::c_uint,
    pub baseFontBig: ::std::os::raw::c_uint,
    pub rangePlane: ::std::os::raw::c_int,
    pub rangeMesh: ::std::os::raw::c_int,
    pub rangeHField: ::std::os::raw::c_int,
    pub rangeBuiltin: ::std::os::raw::c_int,
    pub rangeFont: ::std::os::raw::c_int,
    pub nskin: ::std::os::raw::c_int,
    pub skinvertVBO: *mut ::std::os::raw::c_uint,
    pub skinnormalVBO: *mut ::std::os::raw::c_uint,
    pub skintexcoordVBO: *mut ::std::os::raw::c_uint,
    pub skinfaceVBO: *mut ::std::os::raw::c_uint,
    pub charWidth: [::std::os::raw::c_int; 127usize],
    pub charWidthBig: [::std::os::raw::c_int; 127usize],
    pub charHeight: ::std::os::raw::c_int,
    pub charHeightBig: ::std::os::raw::c_int,
    pub glInitialized: ::std::os::raw::c_int,
    pub windowAvailable: ::std::os::raw::c_int,
    pub windowSamples: ::std::os::raw::c_int,
    pub windowStereo: ::std::os::raw::c_int,
    pub windowDoublebuffer: ::std::os::raw::c_int,
    pub currentBuffer: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjrContext_() {
    const UNINIT: ::std::mem::MaybeUninit<mjrContext_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjrContext_>(),
        2304usize,
        concat!("Size of: ", stringify!(mjrContext_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjrContext_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjrContext_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineWidth) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(lineWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowClip) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(shadowClip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowScale) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(shadowScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fogStart) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(fogStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fogEnd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(fogEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fogRGBA) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(fogRGBA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowSize) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(shadowSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offWidth) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offHeight) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offSamples) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offSamples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fontScale) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(fontScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxWidth) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxHeight) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxSamples) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxSamples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offFBO) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offFBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offFBO_r) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offFBO_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offColor) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offColor_r) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offColor_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offDepthStencil) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offDepthStencil)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).offDepthStencil_r) as usize - ptr as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(offDepthStencil_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowFBO) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(shadowFBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shadowTex) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(shadowTex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxFBO) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxFBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxFBO_r) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxFBO_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxColor) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxColor_r) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(auxColor_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ntexture) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(ntexture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).textureType) as usize - ptr as usize },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(textureType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texture) as usize - ptr as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(texture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basePlane) as usize - ptr as usize },
        1172usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(basePlane)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseMesh) as usize - ptr as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseMesh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseHField) as usize - ptr as usize },
        1180usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseHField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseBuiltin) as usize - ptr as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseBuiltin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseFontNormal) as usize - ptr as usize },
        1188usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseFontNormal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseFontShadow) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseFontShadow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseFontBig) as usize - ptr as usize },
        1196usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(baseFontBig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangePlane) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(rangePlane)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeMesh) as usize - ptr as usize },
        1204usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(rangeMesh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeHField) as usize - ptr as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(rangeHField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeBuiltin) as usize - ptr as usize },
        1212usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(rangeBuiltin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rangeFont) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(rangeFont)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nskin) as usize - ptr as usize },
        1220usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(nskin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skinvertVBO) as usize - ptr as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(skinvertVBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skinnormalVBO) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(skinnormalVBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skintexcoordVBO) as usize - ptr as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(skintexcoordVBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skinfaceVBO) as usize - ptr as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(skinfaceVBO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).charWidth) as usize - ptr as usize },
        1256usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(charWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).charWidthBig) as usize - ptr as usize },
        1764usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(charWidthBig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).charHeight) as usize - ptr as usize },
        2272usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(charHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).charHeightBig) as usize - ptr as usize },
        2276usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(charHeightBig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).glInitialized) as usize - ptr as usize },
        2280usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(glInitialized)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowAvailable) as usize - ptr as usize },
        2284usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(windowAvailable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowSamples) as usize - ptr as usize },
        2288usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(windowSamples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowStereo) as usize - ptr as usize },
        2292usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(windowStereo)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windowDoublebuffer) as usize - ptr as usize
        },
        2296usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(windowDoublebuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentBuffer) as usize - ptr as usize },
        2300usize,
        concat!(
            "Offset of field: ",
            stringify!(mjrContext_),
            "::",
            stringify!(currentBuffer)
        )
    );
}
impl Default for mjrContext_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjrContext = mjrContext_;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtButton_ {
    NONE = 0,
    LEFT = 1,
    RIGHT = 2,
    MIDDLE = 3,
}
pub use self::mjtButton_ as mjtButton;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtEvent_ {
    NONE = 0,
    MOVE = 1,
    PRESS = 2,
    RELEASE = 3,
    SCROLL = 4,
    KEY = 5,
    RESIZE = 6,
}
pub use self::mjtEvent_ as mjtEvent;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtItem_ {
    END = -2,
    SECTION = -1,
    SEPARATOR = 0,
    STATIC = 1,
    BUTTON = 2,
    CHECKINT = 3,
    CHECKBYTE = 4,
    RADIO = 5,
    RADIOLINE = 6,
    SELECT = 7,
    SLIDERINT = 8,
    SLIDERNUM = 9,
    EDITINT = 10,
    EDITNUM = 11,
    EDITTXT = 12,
    mjNITEM = 13,
}
pub use self::mjtItem_ as mjtItem;
pub type mjfItemEnable = ::std::option::Option<
    unsafe extern "C" fn(
        category: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjuiState_ {
    pub nrect: ::std::os::raw::c_int,
    pub rect: [mjrRect; 25usize],
    pub userdata: *mut ::std::os::raw::c_void,
    pub type_: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub middle: ::std::os::raw::c_int,
    pub doubleclick: ::std::os::raw::c_int,
    pub button: ::std::os::raw::c_int,
    pub buttontime: f64,
    pub x: f64,
    pub y: f64,
    pub dx: f64,
    pub dy: f64,
    pub sx: f64,
    pub sy: f64,
    pub control: ::std::os::raw::c_int,
    pub shift: ::std::os::raw::c_int,
    pub alt: ::std::os::raw::c_int,
    pub key: ::std::os::raw::c_int,
    pub keytime: f64,
    pub mouserect: ::std::os::raw::c_int,
    pub dragrect: ::std::os::raw::c_int,
    pub dragbutton: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjuiState_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiState_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiState_>(),
        536usize,
        concat!("Size of: ", stringify!(mjuiState_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiState_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiState_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nrect) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(nrect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(rect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).middle) as usize - ptr as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(middle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).doubleclick) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(doubleclick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).button) as usize - ptr as usize },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(button)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buttontime) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(buttontime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dx) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(dx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dy) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(dy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sx) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(sx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sy) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(sy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).control) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shift) as usize - ptr as usize },
        500usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keytime) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(keytime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mouserect) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(mouserect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dragrect) as usize - ptr as usize },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(dragrect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dragbutton) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiState_),
            "::",
            stringify!(dragbutton)
        )
    );
}
impl Default for mjuiState_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjuiState = mjuiState_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjuiThemeSpacing_ {
    pub total: ::std::os::raw::c_int,
    pub scroll: ::std::os::raw::c_int,
    pub label: ::std::os::raw::c_int,
    pub section: ::std::os::raw::c_int,
    pub itemside: ::std::os::raw::c_int,
    pub itemmid: ::std::os::raw::c_int,
    pub itemver: ::std::os::raw::c_int,
    pub texthor: ::std::os::raw::c_int,
    pub textver: ::std::os::raw::c_int,
    pub linescroll: ::std::os::raw::c_int,
    pub samples: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjuiThemeSpacing_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiThemeSpacing_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiThemeSpacing_>(),
        44usize,
        concat!("Size of: ", stringify!(mjuiThemeSpacing_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiThemeSpacing_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjuiThemeSpacing_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scroll) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(scroll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).section) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(section)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itemside) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(itemside)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itemmid) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(itemmid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itemver) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(itemver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texthor) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(texthor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).textver) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(textver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linescroll) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(linescroll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeSpacing_),
            "::",
            stringify!(samples)
        )
    );
}
pub type mjuiThemeSpacing = mjuiThemeSpacing_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjuiThemeColor_ {
    pub master: [f32; 3usize],
    pub thumb: [f32; 3usize],
    pub secttitle: [f32; 3usize],
    pub sectfont: [f32; 3usize],
    pub sectsymbol: [f32; 3usize],
    pub sectpane: [f32; 3usize],
    pub shortcut: [f32; 3usize],
    pub fontactive: [f32; 3usize],
    pub fontinactive: [f32; 3usize],
    pub decorinactive: [f32; 3usize],
    pub decorinactive2: [f32; 3usize],
    pub button: [f32; 3usize],
    pub check: [f32; 3usize],
    pub radio: [f32; 3usize],
    pub select: [f32; 3usize],
    pub select2: [f32; 3usize],
    pub slider: [f32; 3usize],
    pub slider2: [f32; 3usize],
    pub edit: [f32; 3usize],
    pub edit2: [f32; 3usize],
    pub cursor: [f32; 3usize],
}
#[test]
fn bindgen_test_layout_mjuiThemeColor_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiThemeColor_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiThemeColor_>(),
        252usize,
        concat!("Size of: ", stringify!(mjuiThemeColor_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiThemeColor_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjuiThemeColor_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thumb) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(thumb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secttitle) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(secttitle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectfont) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(sectfont)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectsymbol) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(sectsymbol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectpane) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(sectpane)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(shortcut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fontactive) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(fontactive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fontinactive) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(fontinactive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decorinactive) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(decorinactive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decorinactive2) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(decorinactive2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).button) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(button)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).check) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(check)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radio) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(radio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).select) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(select)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).select2) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(select2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slider) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(slider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slider2) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(slider2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edit) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(edit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edit2) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(edit2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursor) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiThemeColor_),
            "::",
            stringify!(cursor)
        )
    );
}
pub type mjuiThemeColor = mjuiThemeColor_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjuiItemSingle_ {
    pub modifier: ::std::os::raw::c_int,
    pub shortcut: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mjuiItemSingle_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItemSingle_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItemSingle_>(),
        8usize,
        concat!("Size of: ", stringify!(mjuiItemSingle_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItemSingle_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjuiItemSingle_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemSingle_),
            "::",
            stringify!(modifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemSingle_),
            "::",
            stringify!(shortcut)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjuiItemMulti_ {
    pub nelem: ::std::os::raw::c_int,
    pub name: [[::std::os::raw::c_char; 40usize]; 35usize],
}
#[test]
fn bindgen_test_layout_mjuiItemMulti_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItemMulti_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItemMulti_>(),
        1404usize,
        concat!("Size of: ", stringify!(mjuiItemMulti_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItemMulti_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjuiItemMulti_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nelem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemMulti_),
            "::",
            stringify!(nelem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemMulti_),
            "::",
            stringify!(name)
        )
    );
}
impl Default for mjuiItemMulti_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjuiItemSlider_ {
    pub range: [f64; 2usize],
    pub divisions: f64,
}
#[test]
fn bindgen_test_layout_mjuiItemSlider_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItemSlider_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItemSlider_>(),
        24usize,
        concat!("Size of: ", stringify!(mjuiItemSlider_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItemSlider_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiItemSlider_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemSlider_),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).divisions) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemSlider_),
            "::",
            stringify!(divisions)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjuiItemEdit_ {
    pub nelem: ::std::os::raw::c_int,
    pub range: [[f64; 2usize]; 7usize],
}
#[test]
fn bindgen_test_layout_mjuiItemEdit_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItemEdit_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItemEdit_>(),
        120usize,
        concat!("Size of: ", stringify!(mjuiItemEdit_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItemEdit_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiItemEdit_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nelem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemEdit_),
            "::",
            stringify!(nelem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItemEdit_),
            "::",
            stringify!(range)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mjuiItem_ {
    pub type_: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 40usize],
    pub state: ::std::os::raw::c_int,
    pub pdata: *mut ::std::os::raw::c_void,
    pub sectionid: ::std::os::raw::c_int,
    pub itemid: ::std::os::raw::c_int,
    pub __bindgen_anon_1: mjuiItem___bindgen_ty_1,
    pub rect: mjrRect,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mjuiItem___bindgen_ty_1 {
    pub single: mjuiItemSingle_,
    pub multi: mjuiItemMulti_,
    pub slider: mjuiItemSlider_,
    pub edit: mjuiItemEdit_,
}
#[test]
fn bindgen_test_layout_mjuiItem___bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItem___bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItem___bindgen_ty_1>(),
        1408usize,
        concat!("Size of: ", stringify!(mjuiItem___bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItem___bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiItem___bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).single) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem___bindgen_ty_1),
            "::",
            stringify!(single)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem___bindgen_ty_1),
            "::",
            stringify!(multi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slider) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem___bindgen_ty_1),
            "::",
            stringify!(slider)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem___bindgen_ty_1),
            "::",
            stringify!(edit)
        )
    );
}
impl Default for mjuiItem___bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_mjuiItem_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiItem_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiItem_>(),
        1488usize,
        concat!("Size of: ", stringify!(mjuiItem_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiItem_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiItem_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdata) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(pdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionid) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(sectionid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).itemid) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(itemid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect) as usize - ptr as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiItem_),
            "::",
            stringify!(rect)
        )
    );
}
impl Default for mjuiItem_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjuiItem = mjuiItem_;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mjuiSection_ {
    pub name: [::std::os::raw::c_char; 40usize],
    pub state: ::std::os::raw::c_int,
    pub modifier: ::std::os::raw::c_int,
    pub shortcut: ::std::os::raw::c_int,
    pub nitem: ::std::os::raw::c_int,
    pub item: [mjuiItem; 80usize],
    pub rtitle: mjrRect,
    pub rcontent: mjrRect,
}
#[test]
fn bindgen_test_layout_mjuiSection_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiSection_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiSection_>(),
        119128usize,
        concat!("Size of: ", stringify!(mjuiSection_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiSection_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiSection_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifier) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(modifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortcut) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(shortcut)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nitem) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(nitem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(item)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtitle) as usize - ptr as usize },
        119096usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(rtitle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rcontent) as usize - ptr as usize },
        119112usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiSection_),
            "::",
            stringify!(rcontent)
        )
    );
}
impl Default for mjuiSection_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjuiSection = mjuiSection_;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mjUI_ {
    pub spacing: mjuiThemeSpacing,
    pub color: mjuiThemeColor,
    pub predicate: mjfItemEnable,
    pub userdata: *mut ::std::os::raw::c_void,
    pub rectid: ::std::os::raw::c_int,
    pub auxid: ::std::os::raw::c_int,
    pub radiocol: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub maxheight: ::std::os::raw::c_int,
    pub scroll: ::std::os::raw::c_int,
    pub mousesect: ::std::os::raw::c_int,
    pub mouseitem: ::std::os::raw::c_int,
    pub mousehelp: ::std::os::raw::c_int,
    pub editsect: ::std::os::raw::c_int,
    pub edititem: ::std::os::raw::c_int,
    pub editcursor: ::std::os::raw::c_int,
    pub editscroll: ::std::os::raw::c_int,
    pub edittext: [::std::os::raw::c_char; 300usize],
    pub editchanged: *mut mjuiItem,
    pub nsect: ::std::os::raw::c_int,
    pub sect: [mjuiSection; 10usize],
}
#[test]
fn bindgen_test_layout_mjUI_() {
    const UNINIT: ::std::mem::MaybeUninit<mjUI_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjUI_>(),
        1191968usize,
        concat!("Size of: ", stringify!(mjUI_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjUI_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjUI_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spacing) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).predicate) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(predicate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rectid) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(rectid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).auxid) as usize - ptr as usize },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(auxid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radiocol) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(radiocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxheight) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(maxheight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scroll) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(scroll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mousesect) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(mousesect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mouseitem) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(mouseitem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mousehelp) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(mousehelp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).editsect) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(editsect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edititem) as usize - ptr as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(edititem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).editcursor) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(editcursor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).editscroll) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(editscroll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edittext) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(edittext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).editchanged) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(editchanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nsect) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(nsect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sect) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(mjUI_),
            "::",
            stringify!(sect)
        )
    );
}
impl Default for mjUI_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjUI = mjUI_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjuiDef_ {
    pub type_: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 40usize],
    pub state: ::std::os::raw::c_int,
    pub pdata: *mut ::std::os::raw::c_void,
    pub other: [::std::os::raw::c_char; 300usize],
}
#[test]
fn bindgen_test_layout_mjuiDef_() {
    const UNINIT: ::std::mem::MaybeUninit<mjuiDef_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjuiDef_>(),
        360usize,
        concat!("Size of: ", stringify!(mjuiDef_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjuiDef_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjuiDef_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiDef_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiDef_),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiDef_),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pdata) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiDef_),
            "::",
            stringify!(pdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).other) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjuiDef_),
            "::",
            stringify!(other)
        )
    );
}
impl Default for mjuiDef_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjuiDef = mjuiDef_;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtCatBit_ {
    STATIC = 1,
    DYNAMIC = 2,
    DECOR = 4,
    ALL = 7,
}
pub use self::mjtCatBit_ as mjtCatBit;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtMouse_ {
    NONE = 0,
    ROTATE_V = 1,
    ROTATE_H = 2,
    MOVE_V = 3,
    MOVE_H = 4,
    ZOOM = 5,
    SELECT = 6,
}
pub use self::mjtMouse_ as mjtMouse;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtPertBit_ {
    TRANSLATE = 1,
    ROTATE = 2,
}
pub use self::mjtPertBit_ as mjtPertBit;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtCamera_ {
    FREE = 0,
    TRACKING = 1,
    FIXED = 2,
    USER = 3,
}
pub use self::mjtCamera_ as mjtCamera;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtLabel_ {
    NONE = 0,
    BODY = 1,
    JOINT = 2,
    GEOM = 3,
    SITE = 4,
    CAMERA = 5,
    LIGHT = 6,
    TENDON = 7,
    ACTUATOR = 8,
    CONSTRAINT = 9,
    SKIN = 10,
    SELECTION = 11,
    SELPNT = 12,
    CONTACTFORCE = 13,
    mjNLABEL = 14,
}
pub use self::mjtLabel_ as mjtLabel;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtFrame_ {
    NONE = 0,
    BODY = 1,
    GEOM = 2,
    SITE = 3,
    CAMERA = 4,
    LIGHT = 5,
    CONTACT = 6,
    WORLD = 7,
    mjNFRAME = 8,
}
pub use self::mjtFrame_ as mjtFrame;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtVisFlag_ {
    CONVEXHULL = 0,
    TEXTURE = 1,
    JOINT = 2,
    CAMERA = 3,
    ACTUATOR = 4,
    ACTIVATION = 5,
    LIGHT = 6,
    TENDON = 7,
    RANGEFINDER = 8,
    CONSTRAINT = 9,
    INERTIA = 10,
    SCLINERTIA = 11,
    PERTFORCE = 12,
    PERTOBJ = 13,
    CONTACTPOINT = 14,
    CONTACTFORCE = 15,
    CONTACTSPLIT = 16,
    TRANSPARENT = 17,
    AUTOCONNECT = 18,
    COM = 19,
    SELECT = 20,
    STATIC = 21,
    SKIN = 22,
    mjNVISFLAG = 23,
}
pub use self::mjtVisFlag_ as mjtVisFlag;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtRndFlag_ {
    SHADOW = 0,
    WIREFRAME = 1,
    REFLECTION = 2,
    ADDITIVE = 3,
    SKYBOX = 4,
    FOG = 5,
    HAZE = 6,
    SEGMENT = 7,
    IDCOLOR = 8,
    CULL_FACE = 9,
    mjNRNDFLAG = 10,
}
pub use self::mjtRndFlag_ as mjtRndFlag;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum mjtStereo_ {
    NONE = 0,
    QUADBUFFERED = 1,
    SIDEBYSIDE = 2,
}
pub use self::mjtStereo_ as mjtStereo;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjvPerturb_ {
    pub select: ::std::os::raw::c_int,
    pub skinselect: ::std::os::raw::c_int,
    pub active: ::std::os::raw::c_int,
    pub active2: ::std::os::raw::c_int,
    pub refpos: [mjtNum; 3usize],
    pub refquat: [mjtNum; 4usize],
    pub localpos: [mjtNum; 3usize],
    pub scale: mjtNum,
}
#[test]
fn bindgen_test_layout_mjvPerturb_() {
    const UNINIT: ::std::mem::MaybeUninit<mjvPerturb_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjvPerturb_>(),
        104usize,
        concat!("Size of: ", stringify!(mjvPerturb_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjvPerturb_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjvPerturb_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).select) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(select)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skinselect) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(skinselect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active2) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(active2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refpos) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(refpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refquat) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(refquat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localpos) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(localpos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvPerturb_),
            "::",
            stringify!(scale)
        )
    );
}
pub type mjvPerturb = mjvPerturb_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjvCamera_ {
    pub type_: ::std::os::raw::c_int,
    pub fixedcamid: ::std::os::raw::c_int,
    pub trackbodyid: ::std::os::raw::c_int,
    pub lookat: [mjtNum; 3usize],
    pub distance: mjtNum,
    pub azimuth: mjtNum,
    pub elevation: mjtNum,
}
#[test]
fn bindgen_test_layout_mjvCamera_() {
    const UNINIT: ::std::mem::MaybeUninit<mjvCamera_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjvCamera_>(),
        64usize,
        concat!("Size of: ", stringify!(mjvCamera_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjvCamera_>(),
        8usize,
        concat!("Alignment of ", stringify!(mjvCamera_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fixedcamid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(fixedcamid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trackbodyid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(trackbodyid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lookat) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(lookat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(distance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).azimuth) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(azimuth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvCamera_),
            "::",
            stringify!(elevation)
        )
    );
}
pub type mjvCamera = mjvCamera_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjvGLCamera_ {
    pub pos: [f32; 3usize],
    pub forward: [f32; 3usize],
    pub up: [f32; 3usize],
    pub frustum_center: f32,
    pub frustum_bottom: f32,
    pub frustum_top: f32,
    pub frustum_near: f32,
    pub frustum_far: f32,
}
#[test]
fn bindgen_test_layout_mjvGLCamera_() {
    const UNINIT: ::std::mem::MaybeUninit<mjvGLCamera_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjvGLCamera_>(),
        56usize,
        concat!("Size of: ", stringify!(mjvGLCamera_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjvGLCamera_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjvGLCamera_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).forward) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(forward)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).up) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(up)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frustum_center) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(frustum_center)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frustum_bottom) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(frustum_bottom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frustum_top) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(frustum_top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frustum_near) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(frustum_near)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frustum_far) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGLCamera_),
            "::",
            stringify!(frustum_far)
        )
    );
}
pub type mjvGLCamera = mjvGLCamera_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mjvGeom_ {
    pub type_: ::std::os::raw::c_int,
    pub dataid: ::std::os::raw::c_int,
    pub objtype: ::std::os::raw::c_int,
    pub objid: ::std::os::raw::c_int,
    pub category: ::std::os::raw::c_int,
    pub texid: ::std::os::raw::c_int,
    pub texuniform: ::std::os::raw::c_int,
    pub texcoord: ::std::os::raw::c_int,
    pub segid: ::std::os::raw::c_int,
    pub texrepeat: [f32; 2usize],
    pub size: [f32; 3usize],
    pub pos: [f32; 3usize],
    pub mat: [f32; 9usize],
    pub rgba: [f32; 4usize],
    pub emission: f32,
    pub specular: f32,
    pub shininess: f32,
    pub reflectance: f32,
    pub label: [::std::os::raw::c_char; 100usize],
    pub camdist: f32,
    pub modelrbound: f32,
    pub transparent: mjtByte,
}
#[test]
fn bindgen_test_layout_mjvGeom_() {
    const UNINIT: ::std::mem::MaybeUninit<mjvGeom_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjvGeom_>(),
        248usize,
        concat!("Size of: ", stringify!(mjvGeom_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjvGeom_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjvGeom_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(dataid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objtype) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(objtype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objid) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(objid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).category) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(category)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texid) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(texid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texuniform) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(texuniform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texcoord) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(texcoord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(segid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).texrepeat) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(texrepeat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mat) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(mat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgba) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(rgba)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).emission) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(emission)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).specular) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(specular)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shininess) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(shininess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reflectance) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(reflectance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camdist) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(camdist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modelrbound) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(modelrbound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).transparent) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvGeom_),
            "::",
            stringify!(transparent)
        )
    );
}
impl Default for mjvGeom_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mjvGeom = mjvGeom_;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct mjvLight_ {
    pub pos: [f32; 3usize],
    pub dir: [f32; 3usize],
    pub attenuation: [f32; 3usize],
    pub cutoff: f32,
    pub exponent: f32,
    pub ambient: [f32; 3usize],
    pub diffuse: [f32; 3usize],
    pub specular: [f32; 3usize],
    pub headlight: mjtByte,
    pub directional: mjtByte,
    pub castshadow: mjtByte,
}
#[test]
fn bindgen_test_layout_mjvLight_() {
    const UNINIT: ::std::mem::MaybeUninit<mjvLight_> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mjvLight_>(),
        84usize,
        concat!("Size of: ", stringify!(mjvLight_))
    );
    assert_eq!(
        ::std::mem::align_of::<mjvLight_>(),
        4usize,
        concat!("Alignment of ", stringify!(mjvLight_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mjvLight_),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        12usize,
        concat!(
